Masmiseim36/iMXRT/targets/iMXRT/devices/iMXRT1160/periph/PERI_CAAM.h
#define CAAM_RTMCTL_CLK_OUT_EN_MASK              (0x10U)
#define CAAM_RTMCTL_CLK_OUT_EN_SHIFT             (4U)
#define CAAM_RTMCTL_CLK_OUT_EN(x)                (((uint32_t)(((uint32_t)(x)) << CAAM_RTMCTL_CLK_OUT_EN_SHIFT)) & CAAM_RTMCTL_CLK_OUT_EN_MASK)

#define CAAM_RTMCTL_TRNG_ACC_MASK                (0x20U)
#define CAAM_RTMCTL_TRNG_ACC_SHIFT               (5U)
#define CAAM_RTMCTL_TRNG_ACC(x)                  (((uint32_t)(((uint32_t)(x)) << CAAM_RTMCTL_TRNG_ACC_SHIFT)) & CAAM_RTMCTL_TRNG_ACC_MASK)

#define CAAM_RTMCTL_RST_DEF_MASK                 (0x40U)
#define CAAM_RTMCTL_RST_DEF_SHIFT                (6U)
#define CAAM_RTMCTL_RST_DEF(x)                   (((uint32_t)(((uint32_t)(x)) << CAAM_RTMCTL_RST_DEF_SHIFT)) & CAAM_RTMCTL_RST_DEF_MASK)

#define CAAM_RTMCTL_FORCE_SYSCLK_MASK            (0x80U)
#define CAAM_RTMCTL_FORCE_SYSCLK_SHIFT           (7U)
#define CAAM_RTMCTL_FORCE_SYSCLK(x)              (((uint32_t)(((uint32_t)(x)) << CAAM_RTMCTL_FORCE_SYSCLK_SHIFT)) & CAAM_RTMCTL_FORCE_SYSCLK_MASK)

#define CAAM_RTMCTL_FCT_FAIL_MASK                (0x100U)
#define CAAM_RTMCTL_FCT_FAIL_SHIFT               (8U)
#define CAAM_RTMCTL_FCT_FAIL(x)                  (((uint32_t)(((uint32_t)(x)) << CAAM_RTMCTL_FCT_FAIL_SHIFT)) & CAAM_RTMCTL_FCT_FAIL_MASK)

#define CAAM_RTMCTL_FCT_VAL_MASK                 (0x200U)
#define CAAM_RTMCTL_FCT_VAL_SHIFT                (9U)
#define CAAM_RTMCTL_FCT_VAL(x)                   (((uint32_t)(((uint32_t)(x)) << CAAM_RTMCTL_FCT_VAL_SHIFT)) & CAAM_RTMCTL_FCT_VAL_MASK)

#define CAAM_RTMCTL_ENT_VAL_MASK                 (0x400U)
#define CAAM_RTMCTL_ENT_VAL_SHIFT                (10U)
#define CAAM_RTMCTL_ENT_VAL(x)                   (((uint32_t)(((uint32_t)(x)) << CAAM_RTMCTL_ENT_VAL_SHIFT)) & CAAM_RTMCTL_ENT_VAL_MASK)

#define CAAM_RTMCTL_TST_OUT_MASK                 (0x800U)
#define CAAM_RTMCTL_TST_OUT_SHIFT                (11U)
#define CAAM_RTMCTL_TST_OUT(x)                   (((uint32_t)(((uint32_t)(x)) << CAAM_RTMCTL_TST_OUT_SHIFT)) & CAAM_RTMCTL_TST_OUT_MASK)

#define CAAM_RTMCTL_ERR_MASK                     (0x1000U)
#define CAAM_RTMCTL_ERR_SHIFT                    (12U)
#define CAAM_RTMCTL_ERR(x)                       (((uint32_t)(((uint32_t)(x)) << CAAM_RTMCTL_ERR_SHIFT)) & CAAM_RTMCTL_ERR_MASK)

#define CAAM_RTMCTL_TSTOP_OK_MASK                (0x2000U)
#define CAAM_RTMCTL_TSTOP_OK_SHIFT               (13U)
#define CAAM_RTMCTL_TSTOP_OK(x)                  (((uint32_t)(((uint32_t)(x)) << CAAM_RTMCTL_TSTOP_OK_SHIFT)) & CAAM_RTMCTL_TSTOP_OK_MASK)

#define CAAM_RTMCTL_PRGM_MASK                    (0x10000U)
#define CAAM_RTMCTL_PRGM_SHIFT                   (16U)
#define CAAM_RTMCTL_PRGM(x)                      (((uint32_t)(((uint32_t)(x)) << CAAM_RTMCTL_PRGM_SHIFT)) & CAAM_RTMCTL_PRGM_MASK)
/*! @} */

/*! @name RTSCMISC - RNG TRNG Statistical Check Miscellaneous Register */
/*! @{ */

#define CAAM_RTSCMISC_LRUN_MAX_MASK              (0xFFU)
#define CAAM_RTSCMISC_LRUN_MAX_SHIFT             (0U)
#define CAAM_RTSCMISC_LRUN_MAX(x)                (((uint32_t)(((uint32_t)(x)) << CAAM_RTSCMISC_LRUN_MAX_SHIFT)) & CAAM_RTSCMISC_LRUN_MAX_MASK)

#define CAAM_RTSCMISC_RTY_CNT_MASK               (0xF0000U)
#define CAAM_RTSCMISC_RTY_CNT_SHIFT              (16U)
#define CAAM_RTSCMISC_RTY_CNT(x)                 (((uint32_t)(((uint32_t)(x)) << CAAM_RTSCMISC_RTY_CNT_SHIFT)) & CAAM_RTSCMISC_RTY_CNT_MASK)
/*! @} */

/*! @name RTPKRRNG - RNG TRNG Poker Range Register */
/*! @{ */

#define CAAM_RTPKRRNG_PKR_RNG_MASK               (0xFFFFU)
#define CAAM_RTPKRRNG_PKR_RNG_SHIFT              (0U)
#define CAAM_RTPKRRNG_PKR_RNG(x)                 (((uint32_t)(((uint32_t)(x)) << CAAM_RTPKRRNG_PKR_RNG_SHIFT)) & CAAM_RTPKRRNG_PKR_RNG_MASK)
/*! @} */

/*! @name RTPKRMAX - RNG TRNG Poker Maximum Limit Register */
/*! @{ */

#define CAAM_RTPKRMAX_PKR_MAX_MASK               (0xFFFFFFU)
#define CAAM_RTPKRMAX_PKR_MAX_SHIFT              (0U)
#define CAAM_RTPKRMAX_PKR_MAX(x)                 (((uint32_t)(((uint32_t)(x)) << CAAM_RTPKRMAX_PKR_MAX_SHIFT)) & CAAM_RTPKRMAX_PKR_MAX_MASK)
/*! @} */

/*! @name RTPKRSQ - RNG TRNG Poker Square Calculation Result Register */
/*! @{ */

#define CAAM_RTPKRSQ_PKR_SQ_MASK                 (0xFFFFFFU)
#define CAAM_RTPKRSQ_PKR_SQ_SHIFT                (0U)
#define CAAM_RTPKRSQ_PKR_SQ(x)                   (((uint32_t)(((uint32_t)(x)) << CAAM_RTPKRSQ_PKR_SQ_SHIFT)) & CAAM_RTPKRSQ_PKR_SQ_MASK)
/*! @} */

/*! @name RTSDCTL - RNG TRNG Seed Control Register */
/*! @{ */

#define CAAM_RTSDCTL_SAMP_SIZE_MASK              (0xFFFFU)
#define CAAM_RTSDCTL_SAMP_SIZE_SHIFT             (0U)
#define CAAM_RTSDCTL_SAMP_SIZE(x)                (((uint32_t)(((uint32_t)(x)) << CAAM_RTSDCTL_SAMP_SIZE_SHIFT)) & CAAM_RTSDCTL_SAMP_SIZE_MASK)

#define CAAM_RTSDCTL_ENT_DLY_MASK                (0xFFFF0000U)
#define CAAM_RTSDCTL_ENT_DLY_SHIFT               (16U)
#define CAAM_RTSDCTL_ENT_DLY(x)                  (((uint32_t)(((uint32_t)(x)) << CAAM_RTSDCTL_ENT_DLY_SHIFT)) & CAAM_RTSDCTL_ENT_DLY_MASK)
/*! @} */

/*! @name RTSBLIM - RNG TRNG Sparse Bit Limit Register */
/*! @{ */

#define CAAM_RTSBLIM_SB_LIM_MASK                 (0x3FFU)
#define CAAM_RTSBLIM_SB_LIM_SHIFT                (0U)
#define CAAM_RTSBLIM_SB_LIM(x)                   (((uint32_t)(((uint32_t)(x)) << CAAM_RTSBLIM_SB_LIM_SHIFT)) & CAAM_RTSBLIM_SB_LIM_MASK)
/*! @} */

/*! @name RTTOTSAM - RNG TRNG Total Samples Register */
/*! @{ */

#define CAAM_RTTOTSAM_TOT_SAM_MASK               (0xFFFFFU)
#define CAAM_RTTOTSAM_TOT_SAM_SHIFT              (0U)
#define CAAM_RTTOTSAM_TOT_SAM(x)                 (((uint32_t)(((uint32_t)(x)) << CAAM_RTTOTSAM_TOT_SAM_SHIFT)) & CAAM_RTTOTSAM_TOT_SAM_MASK)
/*! @} */

/*! @name RTFRQMIN - RNG TRNG Frequency Count Minimum Limit Register */
/*! @{ */

#define CAAM_RTFRQMIN_FRQ_MIN_MASK               (0x3FFFFFU)
#define CAAM_RTFRQMIN_FRQ_MIN_SHIFT              (0U)
#define CAAM_RTFRQMIN_FRQ_MIN(x)                 (((uint32_t)(((uint32_t)(x)) << CAAM_RTFRQMIN_FRQ_MIN_SHIFT)) & CAAM_RTFRQMIN_FRQ_MIN_MASK)
/*! @} */

/*! @name RTFRQCNT - RNG TRNG Frequency Count Register */
/*! @{ */

#define CAAM_RTFRQCNT_FRQ_CNT_MASK               (0x3FFFFFU)
#define CAAM_RTFRQCNT_FRQ_CNT_SHIFT              (0U)
#define CAAM_RTFRQCNT_FRQ_CNT(x)                 (((uint32_t)(((uint32_t)(x)) << CAAM_RTFRQCNT_FRQ_CNT_SHIFT)) & CAAM_RTFRQCNT_FRQ_CNT_MASK)
/*! @} */

