Masmiseim36/iMXRT/targets/iMXRT/devices/iMXRT1160/periph/PERI_CAAM.h
/* The count of CAAM_HT_STATUS */
#define CAAM_HT_STATUS_COUNT                     (1U)

/*! @name JQ_DEBUG_SEL - Job Queue Debug Select Register */
/*! @{ */

#define CAAM_JQ_DEBUG_SEL_HT_SEL_MASK            (0x1U)
#define CAAM_JQ_DEBUG_SEL_HT_SEL_SHIFT           (0U)
#define CAAM_JQ_DEBUG_SEL_HT_SEL(x)              (((uint32_t)(((uint32_t)(x)) << CAAM_JQ_DEBUG_SEL_HT_SEL_SHIFT)) & CAAM_JQ_DEBUG_SEL_HT_SEL_MASK)

#define CAAM_JQ_DEBUG_SEL_JOB_ID_MASK            (0x70000U)
#define CAAM_JQ_DEBUG_SEL_JOB_ID_SHIFT           (16U)
#define CAAM_JQ_DEBUG_SEL_JOB_ID(x)              (((uint32_t)(((uint32_t)(x)) << CAAM_JQ_DEBUG_SEL_JOB_ID_SHIFT)) & CAAM_JQ_DEBUG_SEL_JOB_ID_MASK)
/*! @} */

/*! @name JRJIDU_LS - Job Ring Job IDs in Use Register, least-significant half */
/*! @{ */

#define CAAM_JRJIDU_LS_JID00_MASK                (0x1U)
#define CAAM_JRJIDU_LS_JID00_SHIFT               (0U)
#define CAAM_JRJIDU_LS_JID00(x)                  (((uint32_t)(((uint32_t)(x)) << CAAM_JRJIDU_LS_JID00_SHIFT)) & CAAM_JRJIDU_LS_JID00_MASK)

#define CAAM_JRJIDU_LS_JID01_MASK                (0x2U)
#define CAAM_JRJIDU_LS_JID01_SHIFT               (1U)
#define CAAM_JRJIDU_LS_JID01(x)                  (((uint32_t)(((uint32_t)(x)) << CAAM_JRJIDU_LS_JID01_SHIFT)) & CAAM_JRJIDU_LS_JID01_MASK)

#define CAAM_JRJIDU_LS_JID02_MASK                (0x4U)
#define CAAM_JRJIDU_LS_JID02_SHIFT               (2U)
#define CAAM_JRJIDU_LS_JID02(x)                  (((uint32_t)(((uint32_t)(x)) << CAAM_JRJIDU_LS_JID02_SHIFT)) & CAAM_JRJIDU_LS_JID02_MASK)

#define CAAM_JRJIDU_LS_JID03_MASK                (0x8U)
#define CAAM_JRJIDU_LS_JID03_SHIFT               (3U)
#define CAAM_JRJIDU_LS_JID03(x)                  (((uint32_t)(((uint32_t)(x)) << CAAM_JRJIDU_LS_JID03_SHIFT)) & CAAM_JRJIDU_LS_JID03_MASK)
/*! @} */

/*! @name JRJDJIFBC - Job Ring Job-Done Job ID FIFO BC */
/*! @{ */

#define CAAM_JRJDJIFBC_BC_MASK                   (0x80000000U)
#define CAAM_JRJDJIFBC_BC_SHIFT                  (31U)
#define CAAM_JRJDJIFBC_BC(x)                     (((uint32_t)(((uint32_t)(x)) << CAAM_JRJDJIFBC_BC_SHIFT)) & CAAM_JRJDJIFBC_BC_MASK)
/*! @} */

/*! @name JRJDJIF - Job Ring Job-Done Job ID FIFO */
/*! @{ */

#define CAAM_JRJDJIF_JOB_ID_ENTRY_MASK           (0x7U)
#define CAAM_JRJDJIF_JOB_ID_ENTRY_SHIFT          (0U)
#define CAAM_JRJDJIF_JOB_ID_ENTRY(x)             (((uint32_t)(((uint32_t)(x)) << CAAM_JRJDJIF_JOB_ID_ENTRY_SHIFT)) & CAAM_JRJDJIF_JOB_ID_ENTRY_MASK)
/*! @} */

/*! @name JRJDS1 - Job Ring Job-Done Source 1 */
/*! @{ */

#define CAAM_JRJDS1_SRC_MASK                     (0x3U)
#define CAAM_JRJDS1_SRC_SHIFT                    (0U)
#define CAAM_JRJDS1_SRC(x)                       (((uint32_t)(((uint32_t)(x)) << CAAM_JRJDS1_SRC_SHIFT)) & CAAM_JRJDS1_SRC_MASK)

#define CAAM_JRJDS1_VALID_MASK                   (0x80000000U)
#define CAAM_JRJDS1_VALID_SHIFT                  (31U)
#define CAAM_JRJDS1_VALID(x)                     (((uint32_t)(((uint32_t)(x)) << CAAM_JRJDS1_VALID_SHIFT)) & CAAM_JRJDS1_VALID_MASK)
/*! @} */

/*! @name JRJDDA - Job Ring Job-Done Descriptor Address 0 Register */
/*! @{ */

#define CAAM_JRJDDA_JD_ADDR_MASK                 (0xFFFFFFFFFU)
#define CAAM_JRJDDA_JD_ADDR_SHIFT                (0U)
#define CAAM_JRJDDA_JD_ADDR(x)                   (((uint64_t)(((uint64_t)(x)) << CAAM_JRJDDA_JD_ADDR_SHIFT)) & CAAM_JRJDDA_JD_ADDR_MASK)
/*! @} */

/* The count of CAAM_JRJDDA */
#define CAAM_JRJDDA_COUNT                        (1U)

/*! @name CRNR_MS - CHA Revision Number Register, most-significant half */
/*! @{ */

#define CAAM_CRNR_MS_CRCRN_MASK                  (0xFU)
#define CAAM_CRNR_MS_CRCRN_SHIFT                 (0U)
#define CAAM_CRNR_MS_CRCRN(x)                    (((uint32_t)(((uint32_t)(x)) << CAAM_CRNR_MS_CRCRN_SHIFT)) & CAAM_CRNR_MS_CRCRN_MASK)

#define CAAM_CRNR_MS_SNW9RN_MASK                 (0xF0U)
#define CAAM_CRNR_MS_SNW9RN_SHIFT                (4U)
#define CAAM_CRNR_MS_SNW9RN(x)                   (((uint32_t)(((uint32_t)(x)) << CAAM_CRNR_MS_SNW9RN_SHIFT)) & CAAM_CRNR_MS_SNW9RN_MASK)

#define CAAM_CRNR_MS_ZERN_MASK                   (0xF00U)
#define CAAM_CRNR_MS_ZERN_SHIFT                  (8U)
#define CAAM_CRNR_MS_ZERN(x)                     (((uint32_t)(((uint32_t)(x)) << CAAM_CRNR_MS_ZERN_SHIFT)) & CAAM_CRNR_MS_ZERN_MASK)

#define CAAM_CRNR_MS_ZARN_MASK                   (0xF000U)
#define CAAM_CRNR_MS_ZARN_SHIFT                  (12U)
#define CAAM_CRNR_MS_ZARN(x)                     (((uint32_t)(((uint32_t)(x)) << CAAM_CRNR_MS_ZARN_SHIFT)) & CAAM_CRNR_MS_ZARN_MASK)

#define CAAM_CRNR_MS_DECORN_MASK                 (0xF000000U)
#define CAAM_CRNR_MS_DECORN_SHIFT                (24U)
#define CAAM_CRNR_MS_DECORN(x)                   (((uint32_t)(((uint32_t)(x)) << CAAM_CRNR_MS_DECORN_SHIFT)) & CAAM_CRNR_MS_DECORN_MASK)

#define CAAM_CRNR_MS_JRRN_MASK                   (0xF0000000U)
#define CAAM_CRNR_MS_JRRN_SHIFT                  (28U)
#define CAAM_CRNR_MS_JRRN(x)                     (((uint32_t)(((uint32_t)(x)) << CAAM_CRNR_MS_JRRN_SHIFT)) & CAAM_CRNR_MS_JRRN_MASK)
/*! @} */

/*! @name CRNR_LS - CHA Revision Number Register, least-significant half */
/*! @{ */

#define CAAM_CRNR_LS_AESRN_MASK                  (0xFU)
#define CAAM_CRNR_LS_AESRN_SHIFT                 (0U)
#define CAAM_CRNR_LS_AESRN(x)                    (((uint32_t)(((uint32_t)(x)) << CAAM_CRNR_LS_AESRN_SHIFT)) & CAAM_CRNR_LS_AESRN_MASK)

#define CAAM_CRNR_LS_DESRN_MASK                  (0xF0U)
#define CAAM_CRNR_LS_DESRN_SHIFT                 (4U)
#define CAAM_CRNR_LS_DESRN(x)                    (((uint32_t)(((uint32_t)(x)) << CAAM_CRNR_LS_DESRN_SHIFT)) & CAAM_CRNR_LS_DESRN_MASK)

#define CAAM_CRNR_LS_MDRN_MASK                   (0xF000U)
#define CAAM_CRNR_LS_MDRN_SHIFT                  (12U)
#define CAAM_CRNR_LS_MDRN(x)                     (((uint32_t)(((uint32_t)(x)) << CAAM_CRNR_LS_MDRN_SHIFT)) & CAAM_CRNR_LS_MDRN_MASK)

#define CAAM_CRNR_LS_RNGRN_MASK                  (0xF0000U)
#define CAAM_CRNR_LS_RNGRN_SHIFT                 (16U)
#define CAAM_CRNR_LS_RNGRN(x)                    (((uint32_t)(((uint32_t)(x)) << CAAM_CRNR_LS_RNGRN_SHIFT)) & CAAM_CRNR_LS_RNGRN_MASK)

