Masmiseim36/iMXRT/targets/iMXRT/devices/iMXRT1160/periph/PERI_CAAM.h
#define CAAM_FAR_FAR_MASK                        (0xFFFFFFFFFU)
#define CAAM_FAR_FAR_SHIFT                       (0U)
#define CAAM_FAR_FAR(x)                          (((uint64_t)(((uint64_t)(x)) << CAAM_FAR_FAR_SHIFT)) & CAAM_FAR_FAR_MASK)
/*! @} */

/*! @name FADID - Fault Address DID Register */
/*! @{ */

#define CAAM_FADID_FDID_MASK                     (0xFU)
#define CAAM_FADID_FDID_SHIFT                    (0U)
#define CAAM_FADID_FDID(x)                       (((uint32_t)(((uint32_t)(x)) << CAAM_FADID_FDID_SHIFT)) & CAAM_FADID_FDID_MASK)

#define CAAM_FADID_FNS_MASK                      (0x10U)
#define CAAM_FADID_FNS_SHIFT                     (4U)
#define CAAM_FADID_FNS(x)                        (((uint32_t)(((uint32_t)(x)) << CAAM_FADID_FNS_SHIFT)) & CAAM_FADID_FNS_MASK)

#define CAAM_FADID_FICID_MASK                    (0xFFE0U)
#define CAAM_FADID_FICID_SHIFT                   (5U)
#define CAAM_FADID_FICID(x)                      (((uint32_t)(((uint32_t)(x)) << CAAM_FADID_FICID_SHIFT)) & CAAM_FADID_FICID_MASK)
/*! @} */

/*! @name FADR - Fault Address Detail Register */
/*! @{ */

#define CAAM_FADR_FSZ_MASK                       (0x7FU)
#define CAAM_FADR_FSZ_SHIFT                      (0U)
#define CAAM_FADR_FSZ(x)                         (((uint32_t)(((uint32_t)(x)) << CAAM_FADR_FSZ_SHIFT)) & CAAM_FADR_FSZ_MASK)

#define CAAM_FADR_TYP_MASK                       (0x80U)
#define CAAM_FADR_TYP_SHIFT                      (7U)
/*! TYP
 *  0b0..Read.
 *  0b1..Write.
 */
#define CAAM_FADR_TYP(x)                         (((uint32_t)(((uint32_t)(x)) << CAAM_FADR_TYP_SHIFT)) & CAAM_FADR_TYP_MASK)

#define CAAM_FADR_BLKID_MASK                     (0xF00U)
#define CAAM_FADR_BLKID_SHIFT                    (8U)
/*! BLKID
 *  0b0100..job queue controller Burst Buffer
 *  0b0101..One of the Job Rings (see JSRC field)
 *  0b1000..DECO0
 */
#define CAAM_FADR_BLKID(x)                       (((uint32_t)(((uint32_t)(x)) << CAAM_FADR_BLKID_SHIFT)) & CAAM_FADR_BLKID_MASK)

#define CAAM_FADR_JSRC_MASK                      (0x7000U)
#define CAAM_FADR_JSRC_SHIFT                     (12U)
/*! JSRC
 *  0b000..Job Ring 0
 *  0b001..Job Ring 1
 *  0b010..Job Ring 2
 *  0b011..Job Ring 3
 *  0b100..RTIC
 *  0b101..reserved
 *  0b110..reserved
 *  0b111..reserved
 */
#define CAAM_FADR_JSRC(x)                        (((uint32_t)(((uint32_t)(x)) << CAAM_FADR_JSRC_SHIFT)) & CAAM_FADR_JSRC_MASK)

#define CAAM_FADR_DTYP_MASK                      (0x8000U)
#define CAAM_FADR_DTYP_SHIFT                     (15U)
/*! DTYP
 *  0b0..message data
 *  0b1..control data
 */
#define CAAM_FADR_DTYP(x)                        (((uint32_t)(((uint32_t)(x)) << CAAM_FADR_DTYP_SHIFT)) & CAAM_FADR_DTYP_MASK)

#define CAAM_FADR_FSZ_EXT_MASK                   (0x70000U)
#define CAAM_FADR_FSZ_EXT_SHIFT                  (16U)
#define CAAM_FADR_FSZ_EXT(x)                     (((uint32_t)(((uint32_t)(x)) << CAAM_FADR_FSZ_EXT_SHIFT)) & CAAM_FADR_FSZ_EXT_MASK)

#define CAAM_FADR_FKMOD_MASK                     (0x1000000U)
#define CAAM_FADR_FKMOD_SHIFT                    (24U)
/*! FKMOD
 *  0b0..CAAM DMA was not attempting to read the key modifier from Secure Memory at the time that the DMA error occurred.
 *  0b1..CAAM DMA was attempting to read the key modifier from Secure Memory at the time that the DMA error occurred.
 */
#define CAAM_FADR_FKMOD(x)                       (((uint32_t)(((uint32_t)(x)) << CAAM_FADR_FKMOD_SHIFT)) & CAAM_FADR_FKMOD_MASK)

#define CAAM_FADR_FKEY_MASK                      (0x2000000U)
#define CAAM_FADR_FKEY_SHIFT                     (25U)
/*! FKEY
 *  0b0..CAAM DMA was not attempting to perform a key read from Secure Memory at the time of the DMA error.
 *  0b1..CAAM DMA was attempting to perform a key read from Secure Memory at the time of the DMA error.
 */
#define CAAM_FADR_FKEY(x)                        (((uint32_t)(((uint32_t)(x)) << CAAM_FADR_FKEY_SHIFT)) & CAAM_FADR_FKEY_MASK)

#define CAAM_FADR_FTDSC_MASK                     (0x4000000U)
#define CAAM_FADR_FTDSC_SHIFT                    (26U)
/*! FTDSC
 *  0b0..CAAM DMA was not executing a Trusted Descriptor at the time of the DMA error.
 *  0b1..CAAM DMA was executing a Trusted Descriptor at the time of the DMA error.
 */
#define CAAM_FADR_FTDSC(x)                       (((uint32_t)(((uint32_t)(x)) << CAAM_FADR_FTDSC_SHIFT)) & CAAM_FADR_FTDSC_MASK)

#define CAAM_FADR_FBNDG_MASK                     (0x8000000U)
#define CAAM_FADR_FBNDG_SHIFT                    (27U)
/*! FBNDG
 *  0b0..CAAM DMA was not reading access permissions from a Secure Memory partition at the time of the DMA error.
 *  0b1..CAAM DMA was reading access permissions from a Secure Memory partition at the time of the DMA error.
 */
#define CAAM_FADR_FBNDG(x)                       (((uint32_t)(((uint32_t)(x)) << CAAM_FADR_FBNDG_SHIFT)) & CAAM_FADR_FBNDG_MASK)

#define CAAM_FADR_FNS_MASK                       (0x10000000U)
#define CAAM_FADR_FNS_SHIFT                      (28U)
/*! FNS
 *  0b0..CAAM DMA was asserting ns=0 at the time of the DMA error.
 *  0b1..CAAM DMA was asserting ns=1 at the time of the DMA error.
 */
#define CAAM_FADR_FNS(x)                         (((uint32_t)(((uint32_t)(x)) << CAAM_FADR_FNS_SHIFT)) & CAAM_FADR_FNS_MASK)

#define CAAM_FADR_FERR_MASK                      (0xC0000000U)
#define CAAM_FADR_FERR_SHIFT                     (30U)
/*! FERR
 *  0b00..OKAY - Normal Access
 *  0b01..Reserved
 *  0b10..SLVERR - Slave Error
 *  0b11..DECERR - Decode Error
 */
#define CAAM_FADR_FERR(x)                        (((uint32_t)(((uint32_t)(x)) << CAAM_FADR_FERR_SHIFT)) & CAAM_FADR_FERR_MASK)
/*! @} */

/*! @name CSTA - CAAM Status Register */
/*! @{ */

#define CAAM_CSTA_BSY_MASK                       (0x1U)
#define CAAM_CSTA_BSY_SHIFT                      (0U)
#define CAAM_CSTA_BSY(x)                         (((uint32_t)(((uint32_t)(x)) << CAAM_CSTA_BSY_SHIFT)) & CAAM_CSTA_BSY_MASK)

#define CAAM_CSTA_IDLE_MASK                      (0x2U)
#define CAAM_CSTA_IDLE_SHIFT                     (1U)
#define CAAM_CSTA_IDLE(x)                        (((uint32_t)(((uint32_t)(x)) << CAAM_CSTA_IDLE_SHIFT)) & CAAM_CSTA_IDLE_MASK)

#define CAAM_CSTA_TRNG_IDLE_MASK                 (0x4U)
#define CAAM_CSTA_TRNG_IDLE_SHIFT                (2U)
#define CAAM_CSTA_TRNG_IDLE(x)                   (((uint32_t)(((uint32_t)(x)) << CAAM_CSTA_TRNG_IDLE_SHIFT)) & CAAM_CSTA_TRNG_IDLE_MASK)

#define CAAM_CSTA_MOO_MASK                       (0x300U)
#define CAAM_CSTA_MOO_SHIFT                      (8U)
/*! MOO
 *  0b00..Non-Secure
 *  0b01..Secure
 *  0b10..Trusted
 *  0b11..Fail
 */
#define CAAM_CSTA_MOO(x)                         (((uint32_t)(((uint32_t)(x)) << CAAM_CSTA_MOO_SHIFT)) & CAAM_CSTA_MOO_MASK)

#define CAAM_CSTA_PLEND_MASK                     (0x400U)
#define CAAM_CSTA_PLEND_SHIFT                    (10U)
/*! PLEND
 *  0b0..Platform default is Little Endian
 *  0b1..Platform default is Big Endian
 */
#define CAAM_CSTA_PLEND(x)                       (((uint32_t)(((uint32_t)(x)) << CAAM_CSTA_PLEND_SHIFT)) & CAAM_CSTA_PLEND_MASK)
/*! @} */

