Masmiseim36/iMXRT/targets/iMXRT/devices/iMXRT1160/periph/PERI_CAAM.h
/*! @name SMVID_MS - Secure Memory Version ID Register, most-significant half */
/*! @{ */

#define CAAM_SMVID_MS_NPAG_MASK                  (0x3FFU)
#define CAAM_SMVID_MS_NPAG_SHIFT                 (0U)
#define CAAM_SMVID_MS_NPAG(x)                    (((uint32_t)(((uint32_t)(x)) << CAAM_SMVID_MS_NPAG_SHIFT)) & CAAM_SMVID_MS_NPAG_MASK)

#define CAAM_SMVID_MS_NPRT_MASK                  (0xF000U)
#define CAAM_SMVID_MS_NPRT_SHIFT                 (12U)
#define CAAM_SMVID_MS_NPRT(x)                    (((uint32_t)(((uint32_t)(x)) << CAAM_SMVID_MS_NPRT_SHIFT)) & CAAM_SMVID_MS_NPRT_MASK)

#define CAAM_SMVID_MS_MAX_NPAG_MASK              (0x3FF0000U)
#define CAAM_SMVID_MS_MAX_NPAG_SHIFT             (16U)
#define CAAM_SMVID_MS_MAX_NPAG(x)                (((uint32_t)(((uint32_t)(x)) << CAAM_SMVID_MS_MAX_NPAG_SHIFT)) & CAAM_SMVID_MS_MAX_NPAG_MASK)
/*! @} */

/*! @name SMVID_LS - Secure Memory Version ID Register, least-significant half */
/*! @{ */

#define CAAM_SMVID_LS_SMNV_MASK                  (0xFFU)
#define CAAM_SMVID_LS_SMNV_SHIFT                 (0U)
#define CAAM_SMVID_LS_SMNV(x)                    (((uint32_t)(((uint32_t)(x)) << CAAM_SMVID_LS_SMNV_SHIFT)) & CAAM_SMVID_LS_SMNV_MASK)

#define CAAM_SMVID_LS_SMJV_MASK                  (0xFF00U)
#define CAAM_SMVID_LS_SMJV_SHIFT                 (8U)
#define CAAM_SMVID_LS_SMJV(x)                    (((uint32_t)(((uint32_t)(x)) << CAAM_SMVID_LS_SMJV_SHIFT)) & CAAM_SMVID_LS_SMJV_MASK)

#define CAAM_SMVID_LS_PSIZ_MASK                  (0x70000U)
#define CAAM_SMVID_LS_PSIZ_SHIFT                 (16U)
#define CAAM_SMVID_LS_PSIZ(x)                    (((uint32_t)(((uint32_t)(x)) << CAAM_SMVID_LS_PSIZ_SHIFT)) & CAAM_SMVID_LS_PSIZ_MASK)
/*! @} */

/*! @name RVID - RTIC Version ID Register */
/*! @{ */

#define CAAM_RVID_RMNV_MASK                      (0xFFU)
#define CAAM_RVID_RMNV_SHIFT                     (0U)
#define CAAM_RVID_RMNV(x)                        (((uint32_t)(((uint32_t)(x)) << CAAM_RVID_RMNV_SHIFT)) & CAAM_RVID_RMNV_MASK)

#define CAAM_RVID_RMJV_MASK                      (0xFF00U)
#define CAAM_RVID_RMJV_SHIFT                     (8U)
#define CAAM_RVID_RMJV(x)                        (((uint32_t)(((uint32_t)(x)) << CAAM_RVID_RMJV_SHIFT)) & CAAM_RVID_RMJV_MASK)

#define CAAM_RVID_SHA_256_MASK                   (0x20000U)
#define CAAM_RVID_SHA_256_SHIFT                  (17U)
/*! SHA_256
 *  0b0..RTIC cannot use the SHA-256 hashing algorithm.
 *  0b1..RTIC can use the SHA-256 hashing algorithm.
 */
#define CAAM_RVID_SHA_256(x)                     (((uint32_t)(((uint32_t)(x)) << CAAM_RVID_SHA_256_SHIFT)) & CAAM_RVID_SHA_256_MASK)

#define CAAM_RVID_SHA_512_MASK                   (0x80000U)
#define CAAM_RVID_SHA_512_SHIFT                  (19U)
/*! SHA_512
 *  0b0..RTIC cannot use the SHA-512 hashing algorithm.
 *  0b1..RTIC can use the SHA-512 hashing algorithm.
 */
#define CAAM_RVID_SHA_512(x)                     (((uint32_t)(((uint32_t)(x)) << CAAM_RVID_SHA_512_SHIFT)) & CAAM_RVID_SHA_512_MASK)

#define CAAM_RVID_MA_MASK                        (0x1000000U)
#define CAAM_RVID_MA_SHIFT                       (24U)
#define CAAM_RVID_MA(x)                          (((uint32_t)(((uint32_t)(x)) << CAAM_RVID_MA_SHIFT)) & CAAM_RVID_MA_MASK)

#define CAAM_RVID_MB_MASK                        (0x2000000U)
#define CAAM_RVID_MB_SHIFT                       (25U)
#define CAAM_RVID_MB(x)                          (((uint32_t)(((uint32_t)(x)) << CAAM_RVID_MB_SHIFT)) & CAAM_RVID_MB_MASK)

#define CAAM_RVID_MC_MASK                        (0x4000000U)
#define CAAM_RVID_MC_SHIFT                       (26U)
#define CAAM_RVID_MC(x)                          (((uint32_t)(((uint32_t)(x)) << CAAM_RVID_MC_SHIFT)) & CAAM_RVID_MC_MASK)

#define CAAM_RVID_MD_MASK                        (0x8000000U)
#define CAAM_RVID_MD_SHIFT                       (27U)
#define CAAM_RVID_MD(x)                          (((uint32_t)(((uint32_t)(x)) << CAAM_RVID_MD_SHIFT)) & CAAM_RVID_MD_MASK)
/*! @} */

/*! @name CCBVID - CHA Cluster Block Version ID Register */
/*! @{ */

#define CAAM_CCBVID_AMNV_MASK                    (0xFFU)
#define CAAM_CCBVID_AMNV_SHIFT                   (0U)
#define CAAM_CCBVID_AMNV(x)                      (((uint32_t)(((uint32_t)(x)) << CAAM_CCBVID_AMNV_SHIFT)) & CAAM_CCBVID_AMNV_MASK)

#define CAAM_CCBVID_AMJV_MASK                    (0xFF00U)
#define CAAM_CCBVID_AMJV_SHIFT                   (8U)
#define CAAM_CCBVID_AMJV(x)                      (((uint32_t)(((uint32_t)(x)) << CAAM_CCBVID_AMJV_SHIFT)) & CAAM_CCBVID_AMJV_MASK)

#define CAAM_CCBVID_CAAM_ERA_MASK                (0xFF000000U)
#define CAAM_CCBVID_CAAM_ERA_SHIFT               (24U)
#define CAAM_CCBVID_CAAM_ERA(x)                  (((uint32_t)(((uint32_t)(x)) << CAAM_CCBVID_CAAM_ERA_SHIFT)) & CAAM_CCBVID_CAAM_ERA_MASK)
/*! @} */

/*! @name CHAVID_MS - CHA Version ID Register, most-significant half */
/*! @{ */

#define CAAM_CHAVID_MS_CRCVID_MASK               (0xFU)
#define CAAM_CHAVID_MS_CRCVID_SHIFT              (0U)
#define CAAM_CHAVID_MS_CRCVID(x)                 (((uint32_t)(((uint32_t)(x)) << CAAM_CHAVID_MS_CRCVID_SHIFT)) & CAAM_CHAVID_MS_CRCVID_MASK)

#define CAAM_CHAVID_MS_SNW9VID_MASK              (0xF0U)
#define CAAM_CHAVID_MS_SNW9VID_SHIFT             (4U)
#define CAAM_CHAVID_MS_SNW9VID(x)                (((uint32_t)(((uint32_t)(x)) << CAAM_CHAVID_MS_SNW9VID_SHIFT)) & CAAM_CHAVID_MS_SNW9VID_MASK)

#define CAAM_CHAVID_MS_ZEVID_MASK                (0xF00U)
#define CAAM_CHAVID_MS_ZEVID_SHIFT               (8U)
#define CAAM_CHAVID_MS_ZEVID(x)                  (((uint32_t)(((uint32_t)(x)) << CAAM_CHAVID_MS_ZEVID_SHIFT)) & CAAM_CHAVID_MS_ZEVID_MASK)

#define CAAM_CHAVID_MS_ZAVID_MASK                (0xF000U)
#define CAAM_CHAVID_MS_ZAVID_SHIFT               (12U)
#define CAAM_CHAVID_MS_ZAVID(x)                  (((uint32_t)(((uint32_t)(x)) << CAAM_CHAVID_MS_ZAVID_SHIFT)) & CAAM_CHAVID_MS_ZAVID_MASK)

#define CAAM_CHAVID_MS_DECOVID_MASK              (0xF000000U)
#define CAAM_CHAVID_MS_DECOVID_SHIFT             (24U)
#define CAAM_CHAVID_MS_DECOVID(x)                (((uint32_t)(((uint32_t)(x)) << CAAM_CHAVID_MS_DECOVID_SHIFT)) & CAAM_CHAVID_MS_DECOVID_MASK)

#define CAAM_CHAVID_MS_JRVID_MASK                (0xF0000000U)
#define CAAM_CHAVID_MS_JRVID_SHIFT               (28U)
#define CAAM_CHAVID_MS_JRVID(x)                  (((uint32_t)(((uint32_t)(x)) << CAAM_CHAVID_MS_JRVID_SHIFT)) & CAAM_CHAVID_MS_JRVID_MASK)
/*! @} */

/*! @name CHAVID_LS - CHA Version ID Register, least-significant half */
/*! @{ */

#define CAAM_CHAVID_LS_AESVID_MASK               (0xFU)
#define CAAM_CHAVID_LS_AESVID_SHIFT              (0U)
/*! AESVID
 *  0b0011..Low-power AESA, implementing ECB, CBC, CBC-CS2, CFB128, OFB, CTR, CCM, CMAC, XCBC-MAC, and GCM modes
 *  0b0100..High-performance AESA, implementing ECB, CBC, CBC-CS2, CFB128, OFB, CTR, CCM, CMAC, XCBC-MAC, CBCXCBC, CTRXCBC, XTS, and GCM modes
 */
#define CAAM_CHAVID_LS_AESVID(x)                 (((uint32_t)(((uint32_t)(x)) << CAAM_CHAVID_LS_AESVID_SHIFT)) & CAAM_CHAVID_LS_AESVID_MASK)

#define CAAM_CHAVID_LS_DESVID_MASK               (0xF0U)
#define CAAM_CHAVID_LS_DESVID_SHIFT              (4U)
#define CAAM_CHAVID_LS_DESVID(x)                 (((uint32_t)(((uint32_t)(x)) << CAAM_CHAVID_LS_DESVID_SHIFT)) & CAAM_CHAVID_LS_DESVID_MASK)

#define CAAM_CHAVID_LS_MDVID_MASK                (0xF000U)
#define CAAM_CHAVID_LS_MDVID_SHIFT               (12U)
/*! MDVID
 *  0b0000..Low-power MDHA, with SHA-1, SHA-256, SHA 224, MD5 and HMAC
 *  0b0001..Low-power MDHA, with SHA-1, SHA-256, SHA 224, SHA-512, SHA-512/224, SHA-512/256, SHA-384, MD5 and HMAC
 *  0b0010..Medium-performance MDHA, with SHA-1, SHA-256, SHA 224, SHA-512, SHA-512/224, SHA-512/256, SHA-384, MD5, HMAC & SMAC
 *  0b0011..High-performance MDHA, with SHA-1, SHA-256, SHA 224, SHA-512, SHA-512/224, SHA-512/256, SHA-384, MD5, HMAC & SMAC
 */
#define CAAM_CHAVID_LS_MDVID(x)                  (((uint32_t)(((uint32_t)(x)) << CAAM_CHAVID_LS_MDVID_SHIFT)) & CAAM_CHAVID_LS_MDVID_MASK)

