Masmiseim36/iMXRT/targets/iMXRT/devices/iMXRT1160/periph/PERI_CAAM.h
#define CAAM_CHAVID_LS_RNGVID_MASK               (0xF0000U)
#define CAAM_CHAVID_LS_RNGVID_SHIFT              (16U)
/*! RNGVID
 *  0b0010..RNGB
 *  0b0100..RNG4
 */
#define CAAM_CHAVID_LS_RNGVID(x)                 (((uint32_t)(((uint32_t)(x)) << CAAM_CHAVID_LS_RNGVID_SHIFT)) & CAAM_CHAVID_LS_RNGVID_MASK)

#define CAAM_CHAVID_LS_SNW8VID_MASK              (0xF00000U)
#define CAAM_CHAVID_LS_SNW8VID_SHIFT             (20U)
#define CAAM_CHAVID_LS_SNW8VID(x)                (((uint32_t)(((uint32_t)(x)) << CAAM_CHAVID_LS_SNW8VID_SHIFT)) & CAAM_CHAVID_LS_SNW8VID_MASK)

#define CAAM_CHAVID_LS_KASVID_MASK               (0xF000000U)
#define CAAM_CHAVID_LS_KASVID_SHIFT              (24U)
#define CAAM_CHAVID_LS_KASVID(x)                 (((uint32_t)(((uint32_t)(x)) << CAAM_CHAVID_LS_KASVID_SHIFT)) & CAAM_CHAVID_LS_KASVID_MASK)

#define CAAM_CHAVID_LS_PKVID_MASK                (0xF0000000U)
#define CAAM_CHAVID_LS_PKVID_SHIFT               (28U)
/*! PKVID
 *  0b0000..PKHA-XT (32-bit); minimum modulus five bytes
 *  0b0001..PKHA-SD (32-bit)
 *  0b0010..PKHA-SD (64-bit)
 *  0b0011..PKHA-SD (128-bit)
 */
#define CAAM_CHAVID_LS_PKVID(x)                  (((uint32_t)(((uint32_t)(x)) << CAAM_CHAVID_LS_PKVID_SHIFT)) & CAAM_CHAVID_LS_PKVID_MASK)
/*! @} */

/*! @name CHANUM_MS - CHA Number Register, most-significant half */
/*! @{ */

#define CAAM_CHANUM_MS_CRCNUM_MASK               (0xFU)
#define CAAM_CHANUM_MS_CRCNUM_SHIFT              (0U)
#define CAAM_CHANUM_MS_CRCNUM(x)                 (((uint32_t)(((uint32_t)(x)) << CAAM_CHANUM_MS_CRCNUM_SHIFT)) & CAAM_CHANUM_MS_CRCNUM_MASK)

#define CAAM_CHANUM_MS_SNW9NUM_MASK              (0xF0U)
#define CAAM_CHANUM_MS_SNW9NUM_SHIFT             (4U)
#define CAAM_CHANUM_MS_SNW9NUM(x)                (((uint32_t)(((uint32_t)(x)) << CAAM_CHANUM_MS_SNW9NUM_SHIFT)) & CAAM_CHANUM_MS_SNW9NUM_MASK)

#define CAAM_CHANUM_MS_ZENUM_MASK                (0xF00U)
#define CAAM_CHANUM_MS_ZENUM_SHIFT               (8U)
#define CAAM_CHANUM_MS_ZENUM(x)                  (((uint32_t)(((uint32_t)(x)) << CAAM_CHANUM_MS_ZENUM_SHIFT)) & CAAM_CHANUM_MS_ZENUM_MASK)

#define CAAM_CHANUM_MS_ZANUM_MASK                (0xF000U)
#define CAAM_CHANUM_MS_ZANUM_SHIFT               (12U)
#define CAAM_CHANUM_MS_ZANUM(x)                  (((uint32_t)(((uint32_t)(x)) << CAAM_CHANUM_MS_ZANUM_SHIFT)) & CAAM_CHANUM_MS_ZANUM_MASK)

#define CAAM_CHANUM_MS_DECONUM_MASK              (0xF000000U)
#define CAAM_CHANUM_MS_DECONUM_SHIFT             (24U)
#define CAAM_CHANUM_MS_DECONUM(x)                (((uint32_t)(((uint32_t)(x)) << CAAM_CHANUM_MS_DECONUM_SHIFT)) & CAAM_CHANUM_MS_DECONUM_MASK)

#define CAAM_CHANUM_MS_JRNUM_MASK                (0xF0000000U)
#define CAAM_CHANUM_MS_JRNUM_SHIFT               (28U)
#define CAAM_CHANUM_MS_JRNUM(x)                  (((uint32_t)(((uint32_t)(x)) << CAAM_CHANUM_MS_JRNUM_SHIFT)) & CAAM_CHANUM_MS_JRNUM_MASK)
/*! @} */

/*! @name CHANUM_LS - CHA Number Register, least-significant half */
/*! @{ */

#define CAAM_CHANUM_LS_AESNUM_MASK               (0xFU)
#define CAAM_CHANUM_LS_AESNUM_SHIFT              (0U)
#define CAAM_CHANUM_LS_AESNUM(x)                 (((uint32_t)(((uint32_t)(x)) << CAAM_CHANUM_LS_AESNUM_SHIFT)) & CAAM_CHANUM_LS_AESNUM_MASK)

#define CAAM_CHANUM_LS_DESNUM_MASK               (0xF0U)
#define CAAM_CHANUM_LS_DESNUM_SHIFT              (4U)
#define CAAM_CHANUM_LS_DESNUM(x)                 (((uint32_t)(((uint32_t)(x)) << CAAM_CHANUM_LS_DESNUM_SHIFT)) & CAAM_CHANUM_LS_DESNUM_MASK)

#define CAAM_CHANUM_LS_ARC4NUM_MASK              (0xF00U)
#define CAAM_CHANUM_LS_ARC4NUM_SHIFT             (8U)
#define CAAM_CHANUM_LS_ARC4NUM(x)                (((uint32_t)(((uint32_t)(x)) << CAAM_CHANUM_LS_ARC4NUM_SHIFT)) & CAAM_CHANUM_LS_ARC4NUM_MASK)

#define CAAM_CHANUM_LS_MDNUM_MASK                (0xF000U)
#define CAAM_CHANUM_LS_MDNUM_SHIFT               (12U)
#define CAAM_CHANUM_LS_MDNUM(x)                  (((uint32_t)(((uint32_t)(x)) << CAAM_CHANUM_LS_MDNUM_SHIFT)) & CAAM_CHANUM_LS_MDNUM_MASK)

#define CAAM_CHANUM_LS_RNGNUM_MASK               (0xF0000U)
#define CAAM_CHANUM_LS_RNGNUM_SHIFT              (16U)
#define CAAM_CHANUM_LS_RNGNUM(x)                 (((uint32_t)(((uint32_t)(x)) << CAAM_CHANUM_LS_RNGNUM_SHIFT)) & CAAM_CHANUM_LS_RNGNUM_MASK)

#define CAAM_CHANUM_LS_SNW8NUM_MASK              (0xF00000U)
#define CAAM_CHANUM_LS_SNW8NUM_SHIFT             (20U)
#define CAAM_CHANUM_LS_SNW8NUM(x)                (((uint32_t)(((uint32_t)(x)) << CAAM_CHANUM_LS_SNW8NUM_SHIFT)) & CAAM_CHANUM_LS_SNW8NUM_MASK)

#define CAAM_CHANUM_LS_KASNUM_MASK               (0xF000000U)
#define CAAM_CHANUM_LS_KASNUM_SHIFT              (24U)
#define CAAM_CHANUM_LS_KASNUM(x)                 (((uint32_t)(((uint32_t)(x)) << CAAM_CHANUM_LS_KASNUM_SHIFT)) & CAAM_CHANUM_LS_KASNUM_MASK)

#define CAAM_CHANUM_LS_PKNUM_MASK                (0xF0000000U)
#define CAAM_CHANUM_LS_PKNUM_SHIFT               (28U)
#define CAAM_CHANUM_LS_PKNUM(x)                  (((uint32_t)(((uint32_t)(x)) << CAAM_CHANUM_LS_PKNUM_SHIFT)) & CAAM_CHANUM_LS_PKNUM_MASK)
/*! @} */

/*! @name IRBAR_JR - Input Ring Base Address Register for Job Ring 0..Input Ring Base Address Register for Job Ring 3 */
/*! @{ */

#define CAAM_IRBAR_JR_IRBA_MASK                  (0xFFFFFFFFFU)
#define CAAM_IRBAR_JR_IRBA_SHIFT                 (0U)
#define CAAM_IRBAR_JR_IRBA(x)                    (((uint64_t)(((uint64_t)(x)) << CAAM_IRBAR_JR_IRBA_SHIFT)) & CAAM_IRBAR_JR_IRBA_MASK)
/*! @} */

/* The count of CAAM_IRBAR_JR */
#define CAAM_IRBAR_JR_COUNT                      (4U)

/*! @name IRSR_JR - Input Ring Size Register for Job Ring 0..Input Ring Size Register for Job Ring 3 */
/*! @{ */

#define CAAM_IRSR_JR_IRS_MASK                    (0x3FFU)
#define CAAM_IRSR_JR_IRS_SHIFT                   (0U)
#define CAAM_IRSR_JR_IRS(x)                      (((uint32_t)(((uint32_t)(x)) << CAAM_IRSR_JR_IRS_SHIFT)) & CAAM_IRSR_JR_IRS_MASK)
/*! @} */

/* The count of CAAM_IRSR_JR */
#define CAAM_IRSR_JR_COUNT                       (4U)

/*! @name IRSAR_JR - Input Ring Slots Available Register for Job Ring 0..Input Ring Slots Available Register for Job Ring 3 */
/*! @{ */

#define CAAM_IRSAR_JR_IRSA_MASK                  (0x3FFU)
#define CAAM_IRSAR_JR_IRSA_SHIFT                 (0U)
#define CAAM_IRSAR_JR_IRSA(x)                    (((uint32_t)(((uint32_t)(x)) << CAAM_IRSAR_JR_IRSA_SHIFT)) & CAAM_IRSAR_JR_IRSA_MASK)
/*! @} */

/* The count of CAAM_IRSAR_JR */
#define CAAM_IRSAR_JR_COUNT                      (4U)

/*! @name IRJAR_JR - Input Ring Jobs Added Register for Job Ring0..Input Ring Jobs Added Register for Job Ring3 */
/*! @{ */

#define CAAM_IRJAR_JR_IRJA_MASK                  (0x3FFU)
#define CAAM_IRJAR_JR_IRJA_SHIFT                 (0U)
#define CAAM_IRJAR_JR_IRJA(x)                    (((uint32_t)(((uint32_t)(x)) << CAAM_IRJAR_JR_IRJA_SHIFT)) & CAAM_IRJAR_JR_IRJA_MASK)
/*! @} */

