Masmiseim36/iMXRT/targets/iMXRT/devices/iMXRT1160/periph/PERI_CAAM.h
/*! @name JRCFGR_JR_MS - Job Ring Configuration Register for Job Ring 0, most-significant half..Job Ring Configuration Register for Job Ring 3, most-significant half */
/*! @{ */

#define CAAM_JRCFGR_JR_MS_MBSI_MASK              (0x1U)
#define CAAM_JRCFGR_JR_MS_MBSI_SHIFT             (0U)
#define CAAM_JRCFGR_JR_MS_MBSI(x)                (((uint32_t)(((uint32_t)(x)) << CAAM_JRCFGR_JR_MS_MBSI_SHIFT)) & CAAM_JRCFGR_JR_MS_MBSI_MASK)

#define CAAM_JRCFGR_JR_MS_MHWSI_MASK             (0x2U)
#define CAAM_JRCFGR_JR_MS_MHWSI_SHIFT            (1U)
#define CAAM_JRCFGR_JR_MS_MHWSI(x)               (((uint32_t)(((uint32_t)(x)) << CAAM_JRCFGR_JR_MS_MHWSI_SHIFT)) & CAAM_JRCFGR_JR_MS_MHWSI_MASK)

#define CAAM_JRCFGR_JR_MS_MWSI_MASK              (0x4U)
#define CAAM_JRCFGR_JR_MS_MWSI_SHIFT             (2U)
#define CAAM_JRCFGR_JR_MS_MWSI(x)                (((uint32_t)(((uint32_t)(x)) << CAAM_JRCFGR_JR_MS_MWSI_SHIFT)) & CAAM_JRCFGR_JR_MS_MWSI_MASK)

#define CAAM_JRCFGR_JR_MS_CBSI_MASK              (0x10U)
#define CAAM_JRCFGR_JR_MS_CBSI_SHIFT             (4U)
#define CAAM_JRCFGR_JR_MS_CBSI(x)                (((uint32_t)(((uint32_t)(x)) << CAAM_JRCFGR_JR_MS_CBSI_SHIFT)) & CAAM_JRCFGR_JR_MS_CBSI_MASK)

#define CAAM_JRCFGR_JR_MS_CHWSI_MASK             (0x20U)
#define CAAM_JRCFGR_JR_MS_CHWSI_SHIFT            (5U)
#define CAAM_JRCFGR_JR_MS_CHWSI(x)               (((uint32_t)(((uint32_t)(x)) << CAAM_JRCFGR_JR_MS_CHWSI_SHIFT)) & CAAM_JRCFGR_JR_MS_CHWSI_MASK)

#define CAAM_JRCFGR_JR_MS_CWSI_MASK              (0x40U)
#define CAAM_JRCFGR_JR_MS_CWSI_SHIFT             (6U)
#define CAAM_JRCFGR_JR_MS_CWSI(x)                (((uint32_t)(((uint32_t)(x)) << CAAM_JRCFGR_JR_MS_CWSI_SHIFT)) & CAAM_JRCFGR_JR_MS_CWSI_MASK)

#define CAAM_JRCFGR_JR_MS_MBSO_MASK              (0x100U)
#define CAAM_JRCFGR_JR_MS_MBSO_SHIFT             (8U)
#define CAAM_JRCFGR_JR_MS_MBSO(x)                (((uint32_t)(((uint32_t)(x)) << CAAM_JRCFGR_JR_MS_MBSO_SHIFT)) & CAAM_JRCFGR_JR_MS_MBSO_MASK)

#define CAAM_JRCFGR_JR_MS_MHWSO_MASK             (0x200U)
#define CAAM_JRCFGR_JR_MS_MHWSO_SHIFT            (9U)
#define CAAM_JRCFGR_JR_MS_MHWSO(x)               (((uint32_t)(((uint32_t)(x)) << CAAM_JRCFGR_JR_MS_MHWSO_SHIFT)) & CAAM_JRCFGR_JR_MS_MHWSO_MASK)

#define CAAM_JRCFGR_JR_MS_MWSO_MASK              (0x400U)
#define CAAM_JRCFGR_JR_MS_MWSO_SHIFT             (10U)
#define CAAM_JRCFGR_JR_MS_MWSO(x)                (((uint32_t)(((uint32_t)(x)) << CAAM_JRCFGR_JR_MS_MWSO_SHIFT)) & CAAM_JRCFGR_JR_MS_MWSO_MASK)

#define CAAM_JRCFGR_JR_MS_CBSO_MASK              (0x1000U)
#define CAAM_JRCFGR_JR_MS_CBSO_SHIFT             (12U)
#define CAAM_JRCFGR_JR_MS_CBSO(x)                (((uint32_t)(((uint32_t)(x)) << CAAM_JRCFGR_JR_MS_CBSO_SHIFT)) & CAAM_JRCFGR_JR_MS_CBSO_MASK)

#define CAAM_JRCFGR_JR_MS_CHWSO_MASK             (0x2000U)
#define CAAM_JRCFGR_JR_MS_CHWSO_SHIFT            (13U)
#define CAAM_JRCFGR_JR_MS_CHWSO(x)               (((uint32_t)(((uint32_t)(x)) << CAAM_JRCFGR_JR_MS_CHWSO_SHIFT)) & CAAM_JRCFGR_JR_MS_CHWSO_MASK)

#define CAAM_JRCFGR_JR_MS_CWSO_MASK              (0x4000U)
#define CAAM_JRCFGR_JR_MS_CWSO_SHIFT             (14U)
#define CAAM_JRCFGR_JR_MS_CWSO(x)                (((uint32_t)(((uint32_t)(x)) << CAAM_JRCFGR_JR_MS_CWSO_SHIFT)) & CAAM_JRCFGR_JR_MS_CWSO_MASK)

#define CAAM_JRCFGR_JR_MS_DMBS_MASK              (0x10000U)
#define CAAM_JRCFGR_JR_MS_DMBS_SHIFT             (16U)
#define CAAM_JRCFGR_JR_MS_DMBS(x)                (((uint32_t)(((uint32_t)(x)) << CAAM_JRCFGR_JR_MS_DMBS_SHIFT)) & CAAM_JRCFGR_JR_MS_DMBS_MASK)

#define CAAM_JRCFGR_JR_MS_PEO_MASK               (0x20000U)
#define CAAM_JRCFGR_JR_MS_PEO_SHIFT              (17U)
#define CAAM_JRCFGR_JR_MS_PEO(x)                 (((uint32_t)(((uint32_t)(x)) << CAAM_JRCFGR_JR_MS_PEO_SHIFT)) & CAAM_JRCFGR_JR_MS_PEO_MASK)

#define CAAM_JRCFGR_JR_MS_DWSO_MASK              (0x40000U)
#define CAAM_JRCFGR_JR_MS_DWSO_SHIFT             (18U)
#define CAAM_JRCFGR_JR_MS_DWSO(x)                (((uint32_t)(((uint32_t)(x)) << CAAM_JRCFGR_JR_MS_DWSO_SHIFT)) & CAAM_JRCFGR_JR_MS_DWSO_MASK)

#define CAAM_JRCFGR_JR_MS_FAIL_MODE_MASK         (0x20000000U)
#define CAAM_JRCFGR_JR_MS_FAIL_MODE_SHIFT        (29U)
#define CAAM_JRCFGR_JR_MS_FAIL_MODE(x)           (((uint32_t)(((uint32_t)(x)) << CAAM_JRCFGR_JR_MS_FAIL_MODE_SHIFT)) & CAAM_JRCFGR_JR_MS_FAIL_MODE_MASK)

#define CAAM_JRCFGR_JR_MS_INCL_SEQ_OUT_MASK      (0x40000000U)
#define CAAM_JRCFGR_JR_MS_INCL_SEQ_OUT_SHIFT     (30U)
#define CAAM_JRCFGR_JR_MS_INCL_SEQ_OUT(x)        (((uint32_t)(((uint32_t)(x)) << CAAM_JRCFGR_JR_MS_INCL_SEQ_OUT_SHIFT)) & CAAM_JRCFGR_JR_MS_INCL_SEQ_OUT_MASK)
/*! @} */

/* The count of CAAM_JRCFGR_JR_MS */
#define CAAM_JRCFGR_JR_MS_COUNT                  (4U)

/*! @name JRCFGR_JR_LS - Job Ring Configuration Register for Job Ring 0, least-significant half..Job Ring Configuration Register for Job Ring 3, least-significant half */
/*! @{ */

#define CAAM_JRCFGR_JR_LS_IMSK_MASK              (0x1U)
#define CAAM_JRCFGR_JR_LS_IMSK_SHIFT             (0U)
/*! IMSK
 *  0b0..Interrupt enabled.
 *  0b1..Interrupt masked.
 */
#define CAAM_JRCFGR_JR_LS_IMSK(x)                (((uint32_t)(((uint32_t)(x)) << CAAM_JRCFGR_JR_LS_IMSK_SHIFT)) & CAAM_JRCFGR_JR_LS_IMSK_MASK)

#define CAAM_JRCFGR_JR_LS_ICEN_MASK              (0x2U)
#define CAAM_JRCFGR_JR_LS_ICEN_SHIFT             (1U)
/*! ICEN
 *  0b0..Interrupt coalescing is disabled. If the IMSK bit is cleared, an interrupt is asserted whenever a job is
 *       written to the output ring. ICDCT is ignored. Note that if software removes one or more jobs and clears
 *       the interrupt but the output rings slots full is still greater than 0 (ORSF > 0), then the interrupt will
 *       clear but reassert on the next clock cycle.
 *  0b1..Interrupt coalescing is enabled. If the IMSK bit is cleared, an interrupt is asserted whenever the
 *       threshold number of frames is reached (ICDCT) or when the threshold timer expires (ICTT). Note that if software
 *       removes one or more jobs and clears the interrupt but the interrupt coalescing threshold is still met
 *       (ORSF >= ICDCT), then the interrupt will clear but reassert on the next clock cycle.
 */
#define CAAM_JRCFGR_JR_LS_ICEN(x)                (((uint32_t)(((uint32_t)(x)) << CAAM_JRCFGR_JR_LS_ICEN_SHIFT)) & CAAM_JRCFGR_JR_LS_ICEN_MASK)

