Masmiseim36/iMXRT/targets/iMXRT/devices/iMXRT1160/periph/PERI_CAAM.h
#define CAAM_JRCFGR_JR_LS_ICDCT_MASK             (0xFF00U)
#define CAAM_JRCFGR_JR_LS_ICDCT_SHIFT            (8U)
#define CAAM_JRCFGR_JR_LS_ICDCT(x)               (((uint32_t)(((uint32_t)(x)) << CAAM_JRCFGR_JR_LS_ICDCT_SHIFT)) & CAAM_JRCFGR_JR_LS_ICDCT_MASK)

#define CAAM_JRCFGR_JR_LS_ICTT_MASK              (0xFFFF0000U)
#define CAAM_JRCFGR_JR_LS_ICTT_SHIFT             (16U)
#define CAAM_JRCFGR_JR_LS_ICTT(x)                (((uint32_t)(((uint32_t)(x)) << CAAM_JRCFGR_JR_LS_ICTT_SHIFT)) & CAAM_JRCFGR_JR_LS_ICTT_MASK)
/*! @} */

/* The count of CAAM_JRCFGR_JR_LS */
#define CAAM_JRCFGR_JR_LS_COUNT                  (4U)

/*! @name IRRIR_JR - Input Ring Read Index Register for Job Ring 0..Input Ring Read Index Register for Job Ring 3 */
/*! @{ */

#define CAAM_IRRIR_JR_IRRI_MASK                  (0x1FFFU)
#define CAAM_IRRIR_JR_IRRI_SHIFT                 (0U)
#define CAAM_IRRIR_JR_IRRI(x)                    (((uint32_t)(((uint32_t)(x)) << CAAM_IRRIR_JR_IRRI_SHIFT)) & CAAM_IRRIR_JR_IRRI_MASK)
/*! @} */

/* The count of CAAM_IRRIR_JR */
#define CAAM_IRRIR_JR_COUNT                      (4U)

/*! @name ORWIR_JR - Output Ring Write Index Register for Job Ring 0..Output Ring Write Index Register for Job Ring 3 */
/*! @{ */

#define CAAM_ORWIR_JR_ORWI_MASK                  (0x3FFFU)
#define CAAM_ORWIR_JR_ORWI_SHIFT                 (0U)
#define CAAM_ORWIR_JR_ORWI(x)                    (((uint32_t)(((uint32_t)(x)) << CAAM_ORWIR_JR_ORWI_SHIFT)) & CAAM_ORWIR_JR_ORWI_MASK)
/*! @} */

/* The count of CAAM_ORWIR_JR */
#define CAAM_ORWIR_JR_COUNT                      (4U)

/*! @name JRCR_JR - Job Ring Command Register for Job Ring 0..Job Ring Command Register for Job Ring 3 */
/*! @{ */

#define CAAM_JRCR_JR_RESET_MASK                  (0x1U)
#define CAAM_JRCR_JR_RESET_SHIFT                 (0U)
#define CAAM_JRCR_JR_RESET(x)                    (((uint32_t)(((uint32_t)(x)) << CAAM_JRCR_JR_RESET_SHIFT)) & CAAM_JRCR_JR_RESET_MASK)

#define CAAM_JRCR_JR_PARK_MASK                   (0x2U)
#define CAAM_JRCR_JR_PARK_SHIFT                  (1U)
#define CAAM_JRCR_JR_PARK(x)                     (((uint32_t)(((uint32_t)(x)) << CAAM_JRCR_JR_PARK_SHIFT)) & CAAM_JRCR_JR_PARK_MASK)
/*! @} */

/* The count of CAAM_JRCR_JR */
#define CAAM_JRCR_JR_COUNT                       (4U)

/*! @name JRAAV - Job Ring 0 Address-Array Valid Register..Job Ring 3 Address-Array Valid Register */
/*! @{ */

#define CAAM_JRAAV_V0_MASK                       (0x1U)
#define CAAM_JRAAV_V0_SHIFT                      (0U)
#define CAAM_JRAAV_V0(x)                         (((uint32_t)(((uint32_t)(x)) << CAAM_JRAAV_V0_SHIFT)) & CAAM_JRAAV_V0_MASK)

#define CAAM_JRAAV_V1_MASK                       (0x2U)
#define CAAM_JRAAV_V1_SHIFT                      (1U)
#define CAAM_JRAAV_V1(x)                         (((uint32_t)(((uint32_t)(x)) << CAAM_JRAAV_V1_SHIFT)) & CAAM_JRAAV_V1_MASK)

#define CAAM_JRAAV_V2_MASK                       (0x4U)
#define CAAM_JRAAV_V2_SHIFT                      (2U)
#define CAAM_JRAAV_V2(x)                         (((uint32_t)(((uint32_t)(x)) << CAAM_JRAAV_V2_SHIFT)) & CAAM_JRAAV_V2_MASK)

#define CAAM_JRAAV_V3_MASK                       (0x8U)
#define CAAM_JRAAV_V3_SHIFT                      (3U)
#define CAAM_JRAAV_V3(x)                         (((uint32_t)(((uint32_t)(x)) << CAAM_JRAAV_V3_SHIFT)) & CAAM_JRAAV_V3_MASK)

#define CAAM_JRAAV_BC_MASK                       (0x80000000U)
#define CAAM_JRAAV_BC_SHIFT                      (31U)
#define CAAM_JRAAV_BC(x)                         (((uint32_t)(((uint32_t)(x)) << CAAM_JRAAV_BC_SHIFT)) & CAAM_JRAAV_BC_MASK)
/*! @} */

/* The count of CAAM_JRAAV */
#define CAAM_JRAAV_COUNT                         (4U)

/*! @name JRAAA - Job Ring 0 Address-Array Address 0 Register..Job Ring 3 Address-Array Address 3 Register */
/*! @{ */

#define CAAM_JRAAA_JD_ADDR_MASK                  (0xFFFFFFFFFU)
#define CAAM_JRAAA_JD_ADDR_SHIFT                 (0U)
#define CAAM_JRAAA_JD_ADDR(x)                    (((uint64_t)(((uint64_t)(x)) << CAAM_JRAAA_JD_ADDR_SHIFT)) & CAAM_JRAAA_JD_ADDR_MASK)
/*! @} */

/* The count of CAAM_JRAAA */
#define CAAM_JRAAA_COUNT                         (4U)

/* The count of CAAM_JRAAA */
#define CAAM_JRAAA_COUNT2                        (4U)

/*! @name PX_SDID_JR - Partition 0 SDID register..Partition 15 SDID register */
/*! @{ */

#define CAAM_PX_SDID_JR_SDID_MASK                (0xFFFFU)
#define CAAM_PX_SDID_JR_SDID_SHIFT               (0U)
#define CAAM_PX_SDID_JR_SDID(x)                  (((uint32_t)(((uint32_t)(x)) << CAAM_PX_SDID_JR_SDID_SHIFT)) & CAAM_PX_SDID_JR_SDID_MASK)
/*! @} */

/* The count of CAAM_PX_SDID_JR */
#define CAAM_PX_SDID_JR_COUNT                    (4U)

/* The count of CAAM_PX_SDID_JR */
#define CAAM_PX_SDID_JR_COUNT2                   (16U)

/*! @name PX_SMAPR_JR - Secure Memory Access Permissions register */
/*! @{ */

#define CAAM_PX_SMAPR_JR_G1_READ_MASK            (0x1U)
#define CAAM_PX_SMAPR_JR_G1_READ_SHIFT           (0U)
/*! G1_READ
 *  0b0..Instruction fetches and reads are prohibited (except that Trusted Descriptor reads (if G1_TDO=1) and
 *       key-reads are always allowed, and exporting Secure Memory Blobs is allowed if G1_SMBLOB=1 or if done by a
 *       Trusted Descriptor and G1_TDO=1).
 *  0b1..Instruction fetches and reads are allowed (but exporting a Secure Memory Blob is prohibited if
 *       G1_SMBLOB=0 and the descriptor is not a Trusted Descriptor or if G1_TDO=0).
 */
#define CAAM_PX_SMAPR_JR_G1_READ(x)              (((uint32_t)(((uint32_t)(x)) << CAAM_PX_SMAPR_JR_G1_READ_SHIFT)) & CAAM_PX_SMAPR_JR_G1_READ_MASK)

#define CAAM_PX_SMAPR_JR_G1_WRITE_MASK           (0x2U)
#define CAAM_PX_SMAPR_JR_G1_WRITE_SHIFT          (1U)
/*! G1_WRITE
 *  0b0..Writes are prohibited (except that Trusted Descriptor writes are allowed, and importing Secure Memory
 *       Blobs is allowed if G1_SMBLOB=1 or if done by a Trusted Descriptor and G1_TDO=1).
 *  0b1..Writes are allowed (but importing a Secure Memory Blob is prohibited if G1_SMBLOB=0 and the descriptor is
 *       not a Trusted Descriptor or if G1_TDO=0).
 */
#define CAAM_PX_SMAPR_JR_G1_WRITE(x)             (((uint32_t)(((uint32_t)(x)) << CAAM_PX_SMAPR_JR_G1_WRITE_SHIFT)) & CAAM_PX_SMAPR_JR_G1_WRITE_MASK)

#define CAAM_PX_SMAPR_JR_G1_TDO_MASK             (0x4U)
#define CAAM_PX_SMAPR_JR_G1_TDO_SHIFT            (2U)
/*! G1_TDO
 *  0b0..Trusted Descriptors have the same access privileges as Job Descriptors
 *  0b1..Trusted Descriptors are allowed to override the other access permissions, i.e. they can export blobs from
 *       or import blobs to the partition and read from and write to the partition regardless of the G1_SMBLOB,
 *       G1_WRITE and G1_READ settings.
 */
#define CAAM_PX_SMAPR_JR_G1_TDO(x)               (((uint32_t)(((uint32_t)(x)) << CAAM_PX_SMAPR_JR_G1_TDO_SHIFT)) & CAAM_PX_SMAPR_JR_G1_TDO_MASK)

