Masmiseim36/iMXRT/targets/iMXRT/devices/iMXRT1160/periph/PERI_CAAM.h
#define CAAM_REIR0JR_MISS_MASK                   (0x80000000U)
#define CAAM_REIR0JR_MISS_SHIFT                  (31U)
#define CAAM_REIR0JR_MISS(x)                     (((uint32_t)(((uint32_t)(x)) << CAAM_REIR0JR_MISS_SHIFT)) & CAAM_REIR0JR_MISS_MASK)
/*! @} */

/* The count of CAAM_REIR0JR */
#define CAAM_REIR0JR_COUNT                       (4U)

/*! @name REIR2JR - Recoverable Error Interrupt Record 2 for Job Ring 0..Recoverable Error Interrupt Record 2 for Job Ring 3 */
/*! @{ */

#define CAAM_REIR2JR_ADDR_MASK                   (0xFFFFFFFFFU)
#define CAAM_REIR2JR_ADDR_SHIFT                  (0U)
#define CAAM_REIR2JR_ADDR(x)                     (((uint64_t)(((uint64_t)(x)) << CAAM_REIR2JR_ADDR_SHIFT)) & CAAM_REIR2JR_ADDR_MASK)
/*! @} */

/* The count of CAAM_REIR2JR */
#define CAAM_REIR2JR_COUNT                       (4U)

/*! @name REIR4JR - Recoverable Error Interrupt Record 4 for Job Ring 0..Recoverable Error Interrupt Record 4 for Job Ring 3 */
/*! @{ */

#define CAAM_REIR4JR_ICID_MASK                   (0x7FFU)
#define CAAM_REIR4JR_ICID_SHIFT                  (0U)
#define CAAM_REIR4JR_ICID(x)                     (((uint32_t)(((uint32_t)(x)) << CAAM_REIR4JR_ICID_SHIFT)) & CAAM_REIR4JR_ICID_MASK)

#define CAAM_REIR4JR_DID_MASK                    (0x7800U)
#define CAAM_REIR4JR_DID_SHIFT                   (11U)
#define CAAM_REIR4JR_DID(x)                      (((uint32_t)(((uint32_t)(x)) << CAAM_REIR4JR_DID_SHIFT)) & CAAM_REIR4JR_DID_MASK)

#define CAAM_REIR4JR_AXCACHE_MASK                (0xF0000U)
#define CAAM_REIR4JR_AXCACHE_SHIFT               (16U)
#define CAAM_REIR4JR_AXCACHE(x)                  (((uint32_t)(((uint32_t)(x)) << CAAM_REIR4JR_AXCACHE_SHIFT)) & CAAM_REIR4JR_AXCACHE_MASK)

#define CAAM_REIR4JR_AXPROT_MASK                 (0x700000U)
#define CAAM_REIR4JR_AXPROT_SHIFT                (20U)
#define CAAM_REIR4JR_AXPROT(x)                   (((uint32_t)(((uint32_t)(x)) << CAAM_REIR4JR_AXPROT_SHIFT)) & CAAM_REIR4JR_AXPROT_MASK)

#define CAAM_REIR4JR_RWB_MASK                    (0x800000U)
#define CAAM_REIR4JR_RWB_SHIFT                   (23U)
#define CAAM_REIR4JR_RWB(x)                      (((uint32_t)(((uint32_t)(x)) << CAAM_REIR4JR_RWB_SHIFT)) & CAAM_REIR4JR_RWB_MASK)

#define CAAM_REIR4JR_ERR_MASK                    (0x30000000U)
#define CAAM_REIR4JR_ERR_SHIFT                   (28U)
#define CAAM_REIR4JR_ERR(x)                      (((uint32_t)(((uint32_t)(x)) << CAAM_REIR4JR_ERR_SHIFT)) & CAAM_REIR4JR_ERR_MASK)

#define CAAM_REIR4JR_MIX_MASK                    (0xC0000000U)
#define CAAM_REIR4JR_MIX_SHIFT                   (30U)
#define CAAM_REIR4JR_MIX(x)                      (((uint32_t)(((uint32_t)(x)) << CAAM_REIR4JR_MIX_SHIFT)) & CAAM_REIR4JR_MIX_MASK)
/*! @} */

/* The count of CAAM_REIR4JR */
#define CAAM_REIR4JR_COUNT                       (4U)

/*! @name REIR5JR - Recoverable Error Interrupt Record 5 for Job Ring 0..Recoverable Error Interrupt Record 5 for Job Ring 3 */
/*! @{ */

#define CAAM_REIR5JR_BID_MASK                    (0xF0000U)
#define CAAM_REIR5JR_BID_SHIFT                   (16U)
#define CAAM_REIR5JR_BID(x)                      (((uint32_t)(((uint32_t)(x)) << CAAM_REIR5JR_BID_SHIFT)) & CAAM_REIR5JR_BID_MASK)

#define CAAM_REIR5JR_BNDG_MASK                   (0x2000000U)
#define CAAM_REIR5JR_BNDG_SHIFT                  (25U)
#define CAAM_REIR5JR_BNDG(x)                     (((uint32_t)(((uint32_t)(x)) << CAAM_REIR5JR_BNDG_SHIFT)) & CAAM_REIR5JR_BNDG_MASK)

#define CAAM_REIR5JR_TDSC_MASK                   (0x4000000U)
#define CAAM_REIR5JR_TDSC_SHIFT                  (26U)
#define CAAM_REIR5JR_TDSC(x)                     (((uint32_t)(((uint32_t)(x)) << CAAM_REIR5JR_TDSC_SHIFT)) & CAAM_REIR5JR_TDSC_MASK)

#define CAAM_REIR5JR_KMOD_MASK                   (0x8000000U)
#define CAAM_REIR5JR_KMOD_SHIFT                  (27U)
#define CAAM_REIR5JR_KMOD(x)                     (((uint32_t)(((uint32_t)(x)) << CAAM_REIR5JR_KMOD_SHIFT)) & CAAM_REIR5JR_KMOD_MASK)

#define CAAM_REIR5JR_KEY_MASK                    (0x10000000U)
#define CAAM_REIR5JR_KEY_SHIFT                   (28U)
#define CAAM_REIR5JR_KEY(x)                      (((uint32_t)(((uint32_t)(x)) << CAAM_REIR5JR_KEY_SHIFT)) & CAAM_REIR5JR_KEY_MASK)

#define CAAM_REIR5JR_SMA_MASK                    (0x20000000U)
#define CAAM_REIR5JR_SMA_SHIFT                   (29U)
#define CAAM_REIR5JR_SMA(x)                      (((uint32_t)(((uint32_t)(x)) << CAAM_REIR5JR_SMA_SHIFT)) & CAAM_REIR5JR_SMA_MASK)
/*! @} */

/* The count of CAAM_REIR5JR */
#define CAAM_REIR5JR_COUNT                       (4U)

/*! @name RSTA - RTIC Status Register */
/*! @{ */

#define CAAM_RSTA_BSY_MASK                       (0x1U)
#define CAAM_RSTA_BSY_SHIFT                      (0U)
/*! BSY
 *  0b0..RTIC Idle.
 *  0b1..RTIC Busy.
 */
#define CAAM_RSTA_BSY(x)                         (((uint32_t)(((uint32_t)(x)) << CAAM_RSTA_BSY_SHIFT)) & CAAM_RSTA_BSY_MASK)

#define CAAM_RSTA_HD_MASK                        (0x2U)
#define CAAM_RSTA_HD_SHIFT                       (1U)
/*! HD
 *  0b0..Boot authentication disabled
 *  0b1..Authenticate code/generate reference hash value. This bit cannot be modified during run-time checking mode.
 */
#define CAAM_RSTA_HD(x)                          (((uint32_t)(((uint32_t)(x)) << CAAM_RSTA_HD_SHIFT)) & CAAM_RSTA_HD_MASK)

#define CAAM_RSTA_SV_MASK                        (0x4U)
#define CAAM_RSTA_SV_SHIFT                       (2U)
/*! SV
 *  0b0..Memory block contents authenticated.
 *  0b1..Memory block hash doesn't match reference value.
 */
#define CAAM_RSTA_SV(x)                          (((uint32_t)(((uint32_t)(x)) << CAAM_RSTA_SV_SHIFT)) & CAAM_RSTA_SV_MASK)

#define CAAM_RSTA_HE_MASK                        (0x8U)
#define CAAM_RSTA_HE_SHIFT                       (3U)
/*! HE
 *  0b0..Memory block contents authenticated.
 *  0b1..Memory block hash doesn't match reference value.
 */
#define CAAM_RSTA_HE(x)                          (((uint32_t)(((uint32_t)(x)) << CAAM_RSTA_HE_SHIFT)) & CAAM_RSTA_HE_MASK)

#define CAAM_RSTA_MIS_MASK                       (0xF0U)
#define CAAM_RSTA_MIS_SHIFT                      (4U)
/*! MIS
 *  0b0000..Memory Block X is valid or state unknown
 *  0b0001..Memory Block X has been corrupted
 */
#define CAAM_RSTA_MIS(x)                         (((uint32_t)(((uint32_t)(x)) << CAAM_RSTA_MIS_SHIFT)) & CAAM_RSTA_MIS_MASK)

