Masmiseim36/iMXRT/targets/iMXRT/devices/iMXRT1160/periph/PERI_CAAM.h
/* The count of CAAM_CC1MR_RNG */
#define CAAM_CC1MR_RNG_COUNT                     (1U)

/*! @name CC1KSR - CCB 0 Class 1 Key Size Register */
/*! @{ */

#define CAAM_CC1KSR_C1KS_MASK                    (0x7FU)
#define CAAM_CC1KSR_C1KS_SHIFT                   (0U)
#define CAAM_CC1KSR_C1KS(x)                      (((uint32_t)(((uint32_t)(x)) << CAAM_CC1KSR_C1KS_SHIFT)) & CAAM_CC1KSR_C1KS_MASK)
/*! @} */

/* The count of CAAM_CC1KSR */
#define CAAM_CC1KSR_COUNT                        (1U)

/*! @name CC1DSR - CCB 0 Class 1 Data Size Register */
/*! @{ */

#define CAAM_CC1DSR_C1DS_MASK                    (0xFFFFFFFFU)
#define CAAM_CC1DSR_C1DS_SHIFT                   (0U)
#define CAAM_CC1DSR_C1DS(x)                      (((uint64_t)(((uint64_t)(x)) << CAAM_CC1DSR_C1DS_SHIFT)) & CAAM_CC1DSR_C1DS_MASK)

#define CAAM_CC1DSR_C1CY_MASK                    (0x100000000U)
#define CAAM_CC1DSR_C1CY_SHIFT                   (32U)
/*! C1CY
 *  0b0..No carry out of the C1 Data Size Reg.
 *  0b1..There was a carry out of the C1 Data Size Reg.
 */
#define CAAM_CC1DSR_C1CY(x)                      (((uint64_t)(((uint64_t)(x)) << CAAM_CC1DSR_C1CY_SHIFT)) & CAAM_CC1DSR_C1CY_MASK)

#define CAAM_CC1DSR_NUMBITS_MASK                 (0xE000000000000000U)
#define CAAM_CC1DSR_NUMBITS_SHIFT                (61U)
#define CAAM_CC1DSR_NUMBITS(x)                   (((uint64_t)(((uint64_t)(x)) << CAAM_CC1DSR_NUMBITS_SHIFT)) & CAAM_CC1DSR_NUMBITS_MASK)
/*! @} */

/* The count of CAAM_CC1DSR */
#define CAAM_CC1DSR_COUNT                        (1U)

/*! @name CC1ICVSR - CCB 0 Class 1 ICV Size Register */
/*! @{ */

#define CAAM_CC1ICVSR_C1ICVS_MASK                (0x1FU)
#define CAAM_CC1ICVSR_C1ICVS_SHIFT               (0U)
#define CAAM_CC1ICVSR_C1ICVS(x)                  (((uint32_t)(((uint32_t)(x)) << CAAM_CC1ICVSR_C1ICVS_SHIFT)) & CAAM_CC1ICVSR_C1ICVS_MASK)
/*! @} */

/* The count of CAAM_CC1ICVSR */
#define CAAM_CC1ICVSR_COUNT                      (1U)

/*! @name CCCTRL - CCB 0 CHA Control Register */
/*! @{ */

#define CAAM_CCCTRL_CCB_MASK                     (0x1U)
#define CAAM_CCCTRL_CCB_SHIFT                    (0U)
/*! CCB
 *  0b0..Do Not Reset
 *  0b1..Reset CCB
 */
#define CAAM_CCCTRL_CCB(x)                       (((uint32_t)(((uint32_t)(x)) << CAAM_CCCTRL_CCB_SHIFT)) & CAAM_CCCTRL_CCB_MASK)

#define CAAM_CCCTRL_AES_MASK                     (0x2U)
#define CAAM_CCCTRL_AES_SHIFT                    (1U)
/*! AES
 *  0b0..Do Not Reset
 *  0b1..Reset AES Accelerator
 */
#define CAAM_CCCTRL_AES(x)                       (((uint32_t)(((uint32_t)(x)) << CAAM_CCCTRL_AES_SHIFT)) & CAAM_CCCTRL_AES_MASK)

#define CAAM_CCCTRL_DES_MASK                     (0x4U)
#define CAAM_CCCTRL_DES_SHIFT                    (2U)
/*! DES
 *  0b0..Do Not Reset
 *  0b1..Reset DES Accelerator
 */
#define CAAM_CCCTRL_DES(x)                       (((uint32_t)(((uint32_t)(x)) << CAAM_CCCTRL_DES_SHIFT)) & CAAM_CCCTRL_DES_MASK)

#define CAAM_CCCTRL_PK_MASK                      (0x40U)
#define CAAM_CCCTRL_PK_SHIFT                     (6U)
/*! PK
 *  0b0..Do Not Reset
 *  0b1..Reset Public Key Hardware Accelerator
 */
#define CAAM_CCCTRL_PK(x)                        (((uint32_t)(((uint32_t)(x)) << CAAM_CCCTRL_PK_SHIFT)) & CAAM_CCCTRL_PK_MASK)

#define CAAM_CCCTRL_MD_MASK                      (0x80U)
#define CAAM_CCCTRL_MD_SHIFT                     (7U)
/*! MD
 *  0b0..Do Not Reset
 *  0b1..Reset Message Digest Hardware Accelerator
 */
#define CAAM_CCCTRL_MD(x)                        (((uint32_t)(((uint32_t)(x)) << CAAM_CCCTRL_MD_SHIFT)) & CAAM_CCCTRL_MD_MASK)

#define CAAM_CCCTRL_CRC_MASK                     (0x100U)
#define CAAM_CCCTRL_CRC_SHIFT                    (8U)
/*! CRC
 *  0b0..Do Not Reset
 *  0b1..Reset CRC Accelerator
 */
#define CAAM_CCCTRL_CRC(x)                       (((uint32_t)(((uint32_t)(x)) << CAAM_CCCTRL_CRC_SHIFT)) & CAAM_CCCTRL_CRC_MASK)

#define CAAM_CCCTRL_RNG_MASK                     (0x200U)
#define CAAM_CCCTRL_RNG_SHIFT                    (9U)
/*! RNG
 *  0b0..Do Not Reset
 *  0b1..Reset Random Number Generator Block.
 */
#define CAAM_CCCTRL_RNG(x)                       (((uint32_t)(((uint32_t)(x)) << CAAM_CCCTRL_RNG_SHIFT)) & CAAM_CCCTRL_RNG_MASK)

#define CAAM_CCCTRL_UA0_MASK                     (0x10000U)
#define CAAM_CCCTRL_UA0_SHIFT                    (16U)
/*! UA0
 *  0b0..Don't unload the PKHA A0 Memory.
 *  0b1..Unload the PKHA A0 Memory into OFIFO.
 */
#define CAAM_CCCTRL_UA0(x)                       (((uint32_t)(((uint32_t)(x)) << CAAM_CCCTRL_UA0_SHIFT)) & CAAM_CCCTRL_UA0_MASK)

#define CAAM_CCCTRL_UA1_MASK                     (0x20000U)
#define CAAM_CCCTRL_UA1_SHIFT                    (17U)
/*! UA1
 *  0b0..Don't unload the PKHA A1 Memory.
 *  0b1..Unload the PKHA A1 Memory into OFIFO.
 */
#define CAAM_CCCTRL_UA1(x)                       (((uint32_t)(((uint32_t)(x)) << CAAM_CCCTRL_UA1_SHIFT)) & CAAM_CCCTRL_UA1_MASK)

#define CAAM_CCCTRL_UA2_MASK                     (0x40000U)
#define CAAM_CCCTRL_UA2_SHIFT                    (18U)
/*! UA2
 *  0b0..Don't unload the PKHA A2 Memory.
 *  0b1..Unload the PKHA A2 Memory into OFIFO.
 */
#define CAAM_CCCTRL_UA2(x)                       (((uint32_t)(((uint32_t)(x)) << CAAM_CCCTRL_UA2_SHIFT)) & CAAM_CCCTRL_UA2_MASK)

#define CAAM_CCCTRL_UA3_MASK                     (0x80000U)
#define CAAM_CCCTRL_UA3_SHIFT                    (19U)
/*! UA3
 *  0b0..Don't unload the PKHA A3 Memory.
 *  0b1..Unload the PKHA A3 Memory into OFIFO.
 */
#define CAAM_CCCTRL_UA3(x)                       (((uint32_t)(((uint32_t)(x)) << CAAM_CCCTRL_UA3_SHIFT)) & CAAM_CCCTRL_UA3_MASK)

#define CAAM_CCCTRL_UB0_MASK                     (0x100000U)
#define CAAM_CCCTRL_UB0_SHIFT                    (20U)
/*! UB0
 *  0b0..Don't unload the PKHA B0 Memory.
 *  0b1..Unload the PKHA B0 Memory into OFIFO.
 */
#define CAAM_CCCTRL_UB0(x)                       (((uint32_t)(((uint32_t)(x)) << CAAM_CCCTRL_UB0_SHIFT)) & CAAM_CCCTRL_UB0_MASK)

#define CAAM_CCCTRL_UB1_MASK                     (0x200000U)
#define CAAM_CCCTRL_UB1_SHIFT                    (21U)
/*! UB1
 *  0b0..Don't unload the PKHA B1 Memory.
 *  0b1..Unload the PKHA B1 Memory into OFIFO.
 */
#define CAAM_CCCTRL_UB1(x)                       (((uint32_t)(((uint32_t)(x)) << CAAM_CCCTRL_UB1_SHIFT)) & CAAM_CCCTRL_UB1_MASK)

