Masmiseim36/iMXRT/targets/iMXRT/devices/iMXRT1160/periph/PERI_CAAM.h
#define CAAM_CCWR_C1K_MASK                       (0x40U)
#define CAAM_CCWR_C1K_SHIFT                      (6U)
/*! C1K
 *  0b0..Don't clear the Class 1 Key Register.
 *  0b1..Clear the Class 1 Key Register.
 */
#define CAAM_CCWR_C1K(x)                         (((uint32_t)(((uint32_t)(x)) << CAAM_CCWR_C1K_SHIFT)) & CAAM_CCWR_C1K_MASK)

#define CAAM_CCWR_CPKA_MASK                      (0x1000U)
#define CAAM_CCWR_CPKA_SHIFT                     (12U)
/*! CPKA
 *  0b0..Don't clear the PKHA A Size Register.
 *  0b1..Clear the PKHA A Size Register.
 */
#define CAAM_CCWR_CPKA(x)                        (((uint32_t)(((uint32_t)(x)) << CAAM_CCWR_CPKA_SHIFT)) & CAAM_CCWR_CPKA_MASK)

#define CAAM_CCWR_CPKB_MASK                      (0x2000U)
#define CAAM_CCWR_CPKB_SHIFT                     (13U)
/*! CPKB
 *  0b0..Don't clear the PKHA B Size Register.
 *  0b1..Clear the PKHA B Size Register.
 */
#define CAAM_CCWR_CPKB(x)                        (((uint32_t)(((uint32_t)(x)) << CAAM_CCWR_CPKB_SHIFT)) & CAAM_CCWR_CPKB_MASK)

#define CAAM_CCWR_CPKN_MASK                      (0x4000U)
#define CAAM_CCWR_CPKN_SHIFT                     (14U)
/*! CPKN
 *  0b0..Don't clear the PKHA N Size Register.
 *  0b1..Clear the PKHA N Size Register.
 */
#define CAAM_CCWR_CPKN(x)                        (((uint32_t)(((uint32_t)(x)) << CAAM_CCWR_CPKN_SHIFT)) & CAAM_CCWR_CPKN_MASK)

#define CAAM_CCWR_CPKE_MASK                      (0x8000U)
#define CAAM_CCWR_CPKE_SHIFT                     (15U)
/*! CPKE
 *  0b0..Don't clear the PKHA E Size Register..
 *  0b1..Clear the PKHA E Size Register.
 */
#define CAAM_CCWR_CPKE(x)                        (((uint32_t)(((uint32_t)(x)) << CAAM_CCWR_CPKE_SHIFT)) & CAAM_CCWR_CPKE_MASK)

#define CAAM_CCWR_C2M_MASK                       (0x10000U)
#define CAAM_CCWR_C2M_SHIFT                      (16U)
/*! C2M
 *  0b0..Don't clear the Class 2 Mode Register.
 *  0b1..Clear the Class 2 Mode Register.
 */
#define CAAM_CCWR_C2M(x)                         (((uint32_t)(((uint32_t)(x)) << CAAM_CCWR_C2M_SHIFT)) & CAAM_CCWR_C2M_MASK)

#define CAAM_CCWR_C2DS_MASK                      (0x40000U)
#define CAAM_CCWR_C2DS_SHIFT                     (18U)
/*! C2DS
 *  0b0..Don't clear the Class 2 Data Size Register.
 *  0b1..Clear the Class 2 Data Size Register.
 */
#define CAAM_CCWR_C2DS(x)                        (((uint32_t)(((uint32_t)(x)) << CAAM_CCWR_C2DS_SHIFT)) & CAAM_CCWR_C2DS_MASK)

#define CAAM_CCWR_C2C_MASK                       (0x200000U)
#define CAAM_CCWR_C2C_SHIFT                      (21U)
/*! C2C
 *  0b0..Don't clear the Class 2 Context Register.
 *  0b1..Clear the Class 2 Context Register.
 */
#define CAAM_CCWR_C2C(x)                         (((uint32_t)(((uint32_t)(x)) << CAAM_CCWR_C2C_SHIFT)) & CAAM_CCWR_C2C_MASK)

#define CAAM_CCWR_C2K_MASK                       (0x400000U)
#define CAAM_CCWR_C2K_SHIFT                      (22U)
/*! C2K
 *  0b0..Don't clear the Class 2 Key Register.
 *  0b1..Clear the Class 2 Key Register.
 */
#define CAAM_CCWR_C2K(x)                         (((uint32_t)(((uint32_t)(x)) << CAAM_CCWR_C2K_SHIFT)) & CAAM_CCWR_C2K_MASK)

#define CAAM_CCWR_CDS_MASK                       (0x2000000U)
#define CAAM_CCWR_CDS_SHIFT                      (25U)
/*! CDS
 *  0b0..Don't clear the shared descriptor signal.
 *  0b1..Clear the shared descriptor signal.
 */
#define CAAM_CCWR_CDS(x)                         (((uint32_t)(((uint32_t)(x)) << CAAM_CCWR_CDS_SHIFT)) & CAAM_CCWR_CDS_MASK)

#define CAAM_CCWR_C2D_MASK                       (0x4000000U)
#define CAAM_CCWR_C2D_SHIFT                      (26U)
/*! C2D
 *  0b0..Don't clear the Class 2 done interrrupt.
 *  0b1..Clear the Class 2 done interrrupt.
 */
#define CAAM_CCWR_C2D(x)                         (((uint32_t)(((uint32_t)(x)) << CAAM_CCWR_C2D_SHIFT)) & CAAM_CCWR_C2D_MASK)

#define CAAM_CCWR_C1D_MASK                       (0x8000000U)
#define CAAM_CCWR_C1D_SHIFT                      (27U)
/*! C1D
 *  0b0..Don't clear the Class 1 done interrrupt.
 *  0b1..Clear the Class 1 done interrrupt.
 */
#define CAAM_CCWR_C1D(x)                         (((uint32_t)(((uint32_t)(x)) << CAAM_CCWR_C1D_SHIFT)) & CAAM_CCWR_C1D_MASK)

#define CAAM_CCWR_C2RST_MASK                     (0x10000000U)
#define CAAM_CCWR_C2RST_SHIFT                    (28U)
/*! C2RST
 *  0b0..Don't reset the Class 2 CHA.
 *  0b1..Reset the Class 2 CHA.
 */
#define CAAM_CCWR_C2RST(x)                       (((uint32_t)(((uint32_t)(x)) << CAAM_CCWR_C2RST_SHIFT)) & CAAM_CCWR_C2RST_MASK)

#define CAAM_CCWR_C1RST_MASK                     (0x20000000U)
#define CAAM_CCWR_C1RST_SHIFT                    (29U)
/*! C1RST
 *  0b0..Don't reset the Class 1 CHA.
 *  0b1..Reset the Class 1 CHA.
 */
#define CAAM_CCWR_C1RST(x)                       (((uint32_t)(((uint32_t)(x)) << CAAM_CCWR_C1RST_SHIFT)) & CAAM_CCWR_C1RST_MASK)

#define CAAM_CCWR_COF_MASK                       (0x40000000U)
#define CAAM_CCWR_COF_SHIFT                      (30U)
/*! COF
 *  0b0..Don't clear the OFIFO.
 *  0b1..Clear the OFIFO.
 */
#define CAAM_CCWR_COF(x)                         (((uint32_t)(((uint32_t)(x)) << CAAM_CCWR_COF_SHIFT)) & CAAM_CCWR_COF_MASK)

#define CAAM_CCWR_CIF_MASK                       (0x80000000U)
#define CAAM_CCWR_CIF_SHIFT                      (31U)
/*! CIF
 *  0b0..Don't clear the IFIFO.
 *  0b1..Clear the IFIFO.
 */
#define CAAM_CCWR_CIF(x)                         (((uint32_t)(((uint32_t)(x)) << CAAM_CCWR_CIF_SHIFT)) & CAAM_CCWR_CIF_MASK)
/*! @} */

/* The count of CAAM_CCWR */
#define CAAM_CCWR_COUNT                          (1U)

/*! @name CCSTA_MS - CCB 0 Status and Error Register, most-significant half */
/*! @{ */

#define CAAM_CCSTA_MS_ERRID1_MASK                (0xFU)
#define CAAM_CCSTA_MS_ERRID1_SHIFT               (0U)
/*! ERRID1
 *  0b0001..Mode Error
 *  0b0010..Data Size Error, including PKHA N Memory Size Error
 *  0b0011..Key Size Error, including PKHA E Memory Size Error
 *  0b0100..PKHA A Memory Size Error
 *  0b0101..PKHA B Memory Size Error
 *  0b0110..Data Arrived out of Sequence Error
 *  0b0111..PKHA Divide by Zero Error
 *  0b1000..PKHA Modulus Even Error
 *  0b1001..DES Key Parity Error
 *  0b1010..ICV Check Failed
 *  0b1011..Internal Hardware Failure
 *  0b1100..CCM AAD Size Error (either 1. AAD flag in B0 =1 and no AAD type provided, 2. AAD flag in B0 = 0 and
 *          AAD provided, or 3. AAD flag in B0 =1 and not enough AAD provided - expecting more based on AAD size.)
 *  0b1101..Class 1 CHA is not reset
 *  0b1110..Invalid CHA combination was selected
 *  0b1111..Invalid CHA Selected
 */
#define CAAM_CCSTA_MS_ERRID1(x)                  (((uint32_t)(((uint32_t)(x)) << CAAM_CCSTA_MS_ERRID1_SHIFT)) & CAAM_CCSTA_MS_ERRID1_MASK)

#define CAAM_CCSTA_MS_CL1_MASK                   (0xF000U)
#define CAAM_CCSTA_MS_CL1_SHIFT                  (12U)
/*! CL1
 *  0b0001..AES
 *  0b0010..DES
 *  0b0101..RNG
 *  0b1000..Public Key
 */
#define CAAM_CCSTA_MS_CL1(x)                     (((uint32_t)(((uint32_t)(x)) << CAAM_CCSTA_MS_CL1_SHIFT)) & CAAM_CCSTA_MS_CL1_MASK)

#define CAAM_CCSTA_MS_ERRID2_MASK                (0xF0000U)
#define CAAM_CCSTA_MS_ERRID2_SHIFT               (16U)
/*! ERRID2
 *  0b0001..Mode Error
 *  0b0010..Data Size Error
 *  0b0011..Key Size Error
 *  0b0110..Data Arrived out of Sequence Error
 *  0b1010..ICV Check Failed
 *  0b1011..Internal Hardware Failure
 *  0b1110..Invalid CHA combination was selected.
 *  0b1111..Invalid CHA Selected
 */
#define CAAM_CCSTA_MS_ERRID2(x)                  (((uint32_t)(((uint32_t)(x)) << CAAM_CCSTA_MS_ERRID2_SHIFT)) & CAAM_CCSTA_MS_ERRID2_MASK)

#define CAAM_CCSTA_MS_CL2_MASK                   (0xF0000000U)
#define CAAM_CCSTA_MS_CL2_SHIFT                  (28U)
/*! CL2
 *  0b0100..MD5, SHA-1, SHA-224, SHA-256, SHA-384, SHA-512 and SHA-512/224, SHA-512/256
 *  0b1001..CRC
 */
#define CAAM_CCSTA_MS_CL2(x)                     (((uint32_t)(((uint32_t)(x)) << CAAM_CCSTA_MS_CL2_SHIFT)) & CAAM_CCSTA_MS_CL2_MASK)
/*! @} */

/* The count of CAAM_CCSTA_MS */
#define CAAM_CCSTA_MS_COUNT                      (1U)

/*! @name CCSTA_LS - CCB 0 Status and Error Register, least-significant half */
/*! @{ */

#define CAAM_CCSTA_LS_AB_MASK                    (0x2U)
#define CAAM_CCSTA_LS_AB_SHIFT                   (1U)
/*! AB
 *  0b0..AESA Idle
 *  0b1..AESA Busy
 */
#define CAAM_CCSTA_LS_AB(x)                      (((uint32_t)(((uint32_t)(x)) << CAAM_CCSTA_LS_AB_SHIFT)) & CAAM_CCSTA_LS_AB_MASK)

#define CAAM_CCSTA_LS_DB_MASK                    (0x4U)
#define CAAM_CCSTA_LS_DB_SHIFT                   (2U)
/*! DB
 *  0b0..DESA Idle
 *  0b1..DESA Busy
 */
#define CAAM_CCSTA_LS_DB(x)                      (((uint32_t)(((uint32_t)(x)) << CAAM_CCSTA_LS_DB_SHIFT)) & CAAM_CCSTA_LS_DB_MASK)

