Masmiseim36/iMXRT/targets/iMXRT/devices/iMXRT1160/periph/PERI_CAAM.h
/*! @name DJQCR_LS - DECO0 Job Queue Control Register, least-significant half */
/*! @{ */

#define CAAM_DJQCR_LS_CMD_MASK                   (0xFFFFFFFFU)
#define CAAM_DJQCR_LS_CMD_SHIFT                  (0U)
#define CAAM_DJQCR_LS_CMD(x)                     (((uint32_t)(((uint32_t)(x)) << CAAM_DJQCR_LS_CMD_SHIFT)) & CAAM_DJQCR_LS_CMD_MASK)
/*! @} */

/* The count of CAAM_DJQCR_LS */
#define CAAM_DJQCR_LS_COUNT                      (1U)

/*! @name DDAR - DECO0 Descriptor Address Register */
/*! @{ */

#define CAAM_DDAR_DPTR_MASK                      (0xFFFFFFFFFU)
#define CAAM_DDAR_DPTR_SHIFT                     (0U)
#define CAAM_DDAR_DPTR(x)                        (((uint64_t)(((uint64_t)(x)) << CAAM_DDAR_DPTR_SHIFT)) & CAAM_DDAR_DPTR_MASK)
/*! @} */

/* The count of CAAM_DDAR */
#define CAAM_DDAR_COUNT                          (1U)

/*! @name DOPSTA_MS - DECO0 Operation Status Register, most-significant half */
/*! @{ */

#define CAAM_DOPSTA_MS_STATUS_MASK               (0xFFU)
#define CAAM_DOPSTA_MS_STATUS_SHIFT              (0U)
#define CAAM_DOPSTA_MS_STATUS(x)                 (((uint32_t)(((uint32_t)(x)) << CAAM_DOPSTA_MS_STATUS_SHIFT)) & CAAM_DOPSTA_MS_STATUS_MASK)

#define CAAM_DOPSTA_MS_COMMAND_INDEX_MASK        (0x7F00U)
#define CAAM_DOPSTA_MS_COMMAND_INDEX_SHIFT       (8U)
#define CAAM_DOPSTA_MS_COMMAND_INDEX(x)          (((uint32_t)(((uint32_t)(x)) << CAAM_DOPSTA_MS_COMMAND_INDEX_SHIFT)) & CAAM_DOPSTA_MS_COMMAND_INDEX_MASK)

#define CAAM_DOPSTA_MS_NLJ_MASK                  (0x8000000U)
#define CAAM_DOPSTA_MS_NLJ_SHIFT                 (27U)
/*! NLJ
 *  0b0..The original job descriptor running in this DECO has not caused another job descriptor to be executed.
 *  0b1..The original job descriptor running in this DECO has caused another job descriptor to be executed.
 */
#define CAAM_DOPSTA_MS_NLJ(x)                    (((uint32_t)(((uint32_t)(x)) << CAAM_DOPSTA_MS_NLJ_SHIFT)) & CAAM_DOPSTA_MS_NLJ_MASK)

#define CAAM_DOPSTA_MS_STATUS_TYPE_MASK          (0xF0000000U)
#define CAAM_DOPSTA_MS_STATUS_TYPE_SHIFT         (28U)
/*! STATUS_TYPE
 *  0b0000..no error
 *  0b0001..DMA error
 *  0b0010..CCB error
 *  0b0011..Jump Halt User Status
 *  0b0100..DECO error
 *  0b0101, 0b0110..Reserved
 *  0b0111..Jump Halt Condition Code
 */
#define CAAM_DOPSTA_MS_STATUS_TYPE(x)            (((uint32_t)(((uint32_t)(x)) << CAAM_DOPSTA_MS_STATUS_TYPE_SHIFT)) & CAAM_DOPSTA_MS_STATUS_TYPE_MASK)
/*! @} */

/* The count of CAAM_DOPSTA_MS */
#define CAAM_DOPSTA_MS_COUNT                     (1U)

/*! @name DOPSTA_LS - DECO0 Operation Status Register, least-significant half */
/*! @{ */

#define CAAM_DOPSTA_LS_OUT_CT_MASK               (0xFFFFFFFFU)
#define CAAM_DOPSTA_LS_OUT_CT_SHIFT              (0U)
#define CAAM_DOPSTA_LS_OUT_CT(x)                 (((uint32_t)(((uint32_t)(x)) << CAAM_DOPSTA_LS_OUT_CT_SHIFT)) & CAAM_DOPSTA_LS_OUT_CT_MASK)
/*! @} */

/* The count of CAAM_DOPSTA_LS */
#define CAAM_DOPSTA_LS_COUNT                     (1U)

/*! @name DPDIDSR - DECO0 Primary DID Status Register */
/*! @{ */

#define CAAM_DPDIDSR_PRIM_DID_MASK               (0xFU)
#define CAAM_DPDIDSR_PRIM_DID_SHIFT              (0U)
#define CAAM_DPDIDSR_PRIM_DID(x)                 (((uint32_t)(((uint32_t)(x)) << CAAM_DPDIDSR_PRIM_DID_SHIFT)) & CAAM_DPDIDSR_PRIM_DID_MASK)

#define CAAM_DPDIDSR_PRIM_ICID_MASK              (0x3FF80000U)
#define CAAM_DPDIDSR_PRIM_ICID_SHIFT             (19U)
#define CAAM_DPDIDSR_PRIM_ICID(x)                (((uint32_t)(((uint32_t)(x)) << CAAM_DPDIDSR_PRIM_ICID_SHIFT)) & CAAM_DPDIDSR_PRIM_ICID_MASK)
/*! @} */

/* The count of CAAM_DPDIDSR */
#define CAAM_DPDIDSR_COUNT                       (1U)

/*! @name DODIDSR - DECO0 Output DID Status Register */
/*! @{ */

#define CAAM_DODIDSR_OUT_DID_MASK                (0xFU)
#define CAAM_DODIDSR_OUT_DID_SHIFT               (0U)
#define CAAM_DODIDSR_OUT_DID(x)                  (((uint32_t)(((uint32_t)(x)) << CAAM_DODIDSR_OUT_DID_SHIFT)) & CAAM_DODIDSR_OUT_DID_MASK)

#define CAAM_DODIDSR_OUT_ICID_MASK               (0x3FF80000U)
#define CAAM_DODIDSR_OUT_ICID_SHIFT              (19U)
#define CAAM_DODIDSR_OUT_ICID(x)                 (((uint32_t)(((uint32_t)(x)) << CAAM_DODIDSR_OUT_ICID_SHIFT)) & CAAM_DODIDSR_OUT_ICID_MASK)
/*! @} */

/* The count of CAAM_DODIDSR */
#define CAAM_DODIDSR_COUNT                       (1U)

/*! @name DMTH_MS - DECO0 Math Register 0_MS..DECO0 Math Register 3_MS */
/*! @{ */

#define CAAM_DMTH_MS_MATH_MS_MASK                (0xFFFFFFFFU)
#define CAAM_DMTH_MS_MATH_MS_SHIFT               (0U)
#define CAAM_DMTH_MS_MATH_MS(x)                  (((uint32_t)(((uint32_t)(x)) << CAAM_DMTH_MS_MATH_MS_SHIFT)) & CAAM_DMTH_MS_MATH_MS_MASK)
/*! @} */

/* The count of CAAM_DMTH_MS */
#define CAAM_DMTH_MS_COUNT                       (1U)

/* The count of CAAM_DMTH_MS */
#define CAAM_DMTH_MS_COUNT2                      (4U)

/*! @name DMTH_LS - DECO0 Math Register 0_LS..DECO0 Math Register 3_LS */
/*! @{ */

#define CAAM_DMTH_LS_MATH_LS_MASK                (0xFFFFFFFFU)
#define CAAM_DMTH_LS_MATH_LS_SHIFT               (0U)
#define CAAM_DMTH_LS_MATH_LS(x)                  (((uint32_t)(((uint32_t)(x)) << CAAM_DMTH_LS_MATH_LS_SHIFT)) & CAAM_DMTH_LS_MATH_LS_MASK)
/*! @} */

/* The count of CAAM_DMTH_LS */
#define CAAM_DMTH_LS_COUNT                       (1U)

/* The count of CAAM_DMTH_LS */
#define CAAM_DMTH_LS_COUNT2                      (4U)

/*! @name DGTR_0 - DECO0 Gather Table Register 0 Word 0 */
/*! @{ */

#define CAAM_DGTR_0_ADDRESS_POINTER_MASK         (0xFU)
#define CAAM_DGTR_0_ADDRESS_POINTER_SHIFT        (0U)
/*! ADDRESS_POINTER - most-significant bits of memory address pointed to by table entry */
#define CAAM_DGTR_0_ADDRESS_POINTER(x)           (((uint32_t)(((uint32_t)(x)) << CAAM_DGTR_0_ADDRESS_POINTER_SHIFT)) & CAAM_DGTR_0_ADDRESS_POINTER_MASK)
/*! @} */

/* The count of CAAM_DGTR_0 */
#define CAAM_DGTR_0_COUNT                        (1U)

/* The count of CAAM_DGTR_0 */
#define CAAM_DGTR_0_COUNT2                       (1U)

/*! @name DGTR_1 - DECO0 Gather Table Register 0 Word 1 */
/*! @{ */

#define CAAM_DGTR_1_ADDRESS_POINTER_MASK         (0xFFFFFFFFU)
#define CAAM_DGTR_1_ADDRESS_POINTER_SHIFT        (0U)
#define CAAM_DGTR_1_ADDRESS_POINTER(x)           (((uint32_t)(((uint32_t)(x)) << CAAM_DGTR_1_ADDRESS_POINTER_SHIFT)) & CAAM_DGTR_1_ADDRESS_POINTER_MASK)
/*! @} */

/* The count of CAAM_DGTR_1 */
#define CAAM_DGTR_1_COUNT                        (1U)

/* The count of CAAM_DGTR_1 */
#define CAAM_DGTR_1_COUNT2                       (1U)

/*! @name DGTR_2 - DECO0 Gather Table Register 0 Word 2 */
/*! @{ */

