Masmiseim36/iMXRT/targets/iMXRT/devices/iMXRT1160/periph/PERI_CAAM.h
#define CAAM_VSIL_VSIL_MASK                      (0xFFFFFFFFU)
#define CAAM_VSIL_VSIL_SHIFT                     (0U)
#define CAAM_VSIL_VSIL(x)                        (((uint32_t)(((uint32_t)(x)) << CAAM_VSIL_VSIL_SHIFT)) & CAAM_VSIL_VSIL_MASK)
/*! @} */

/* The count of CAAM_VSIL */
#define CAAM_VSIL_COUNT                          (1U)

/*! @name DPOVRD - Protocol Override Register */
/*! @{ */

#define CAAM_DPOVRD_DPOVRD_MASK                  (0xFFFFFFFFU)
#define CAAM_DPOVRD_DPOVRD_SHIFT                 (0U)
#define CAAM_DPOVRD_DPOVRD(x)                    (((uint32_t)(((uint32_t)(x)) << CAAM_DPOVRD_DPOVRD_SHIFT)) & CAAM_DPOVRD_DPOVRD_MASK)
/*! @} */

/* The count of CAAM_DPOVRD */
#define CAAM_DPOVRD_COUNT                        (1U)

/*! @name UVSOL - Variable Sequence Output Length Register; Upper 32 bits */
/*! @{ */

#define CAAM_UVSOL_UVSOL_MASK                    (0xFFFFFFFFU)
#define CAAM_UVSOL_UVSOL_SHIFT                   (0U)
#define CAAM_UVSOL_UVSOL(x)                      (((uint32_t)(((uint32_t)(x)) << CAAM_UVSOL_UVSOL_SHIFT)) & CAAM_UVSOL_UVSOL_MASK)
/*! @} */

/* The count of CAAM_UVSOL */
#define CAAM_UVSOL_COUNT                         (1U)

/*! @name UVSIL - Variable Sequence Input Length Register; Upper 32 bits */
/*! @{ */

#define CAAM_UVSIL_UVSIL_MASK                    (0xFFFFFFFFU)
#define CAAM_UVSIL_UVSIL_SHIFT                   (0U)
#define CAAM_UVSIL_UVSIL(x)                      (((uint32_t)(((uint32_t)(x)) << CAAM_UVSIL_UVSIL_SHIFT)) & CAAM_UVSIL_UVSIL_MASK)
/*! @} */

/* The count of CAAM_UVSIL */
#define CAAM_UVSIL_COUNT                         (1U)


/*!
 * @}
 */ /* end of group CAAM_Register_Masks */


/*!
 * @}
 */ /* end of group CAAM_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__CWCC__)
  #pragma pop
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_CAAM_H_ */

